import { Component, ViewChild } from '@angular/core';

import { NgbDatepickerI18n } from '@ng-bootstrap/ng-bootstrap';
import * as moment from 'moment';
import { DashboardService } from './dashboard.service';
import { Observable } from 'rxjs';
import { AuthService, UserType } from 'src/app/modules/auth';
import { each, toInteger } from 'lodash';




@Component({
  selector: 'app-dashboard',
  templateUrl: './dashboard.component.html',
  styleUrls: ['./dashboard.component.scss'],

  //encapsulation: ViewEncapsulation.None,
})

export class DashboardComponent {

  data: any = [
    {
      "from": 37.48,
      "to": 38.64,
      "location": 2,
      "content": "ตั้งแต่สมัยบรรพกาล"
    },
    {
      "from": 40.31,
      "to": 44.69,
      "location": 2,
      "content": "ทั่วทั้งจักรวาลมีเพียงแค่\nผู้สร้างโลกที่ไร้จิตวิญญาณ \"เดมิเอิร์จ\""
    },
    {
      "from": 45.32,
      "to": 48.6,
      "location": 2,
      "content": "และจิตวิญญาณไม่มีรูปร่างซึ่ง\nปะปนกับแนวคิด..."
    },
    {
      "from": 51.87,
      "to": 56.37,
      "location": 2,
      "content": "อันเป็นรูปลักษณ์ที่แท้จริงของโลกเท่านั้น"
    },
    {
      "from": 62.38,
      "to": 67.67,
      "location": 2,
      "content": "เดมิเอิร์จไม่รู้จักตัวตน\nที่สร้างตัวเองขึันมา"
    },
    {
      "from": 69.09,
      "to": 71.3,
      "location": 2,
      "content": "ไม่รู้แม้กระทั่งจิตวิญญาณ"
    },
    {
      "from": 76.1,
      "to": 78.31,
      "location": 2,
      "content": "และไม่รู้จักแนวคิด"
    },
    {
      "from": 81.52,
      "to": 87.44,
      "location": 2,
      "content": "โลกที่เขาสร้างขึ้นเป็นเพียงแค่\nเงาของโลกที่แท้จริงเท่านั้น"
    },
    {
      "from": 166.77,
      "to": 169.574,
      "location": 2,
      "content": "ขณะนี้เรากำลังตรวจสอบเกี่ยวกับ\nเหตุการณ์ไฟฟ้าดับในวงกว้าง"
    },
    {
      "from": 169.598,
      "to": 171.9,
      "location": 2,
      "content": "ที่เกิดขึ้นบริเวณ\nโรงงานของคาวาซากิเมื่อวันก่อน"
    },
    {
      "from": 171.9,
      "to": 173.7,
      "location": 2,
      "content": "แต่ยังไม่ทราบสาเหตุแน่ชัดค่ะ"
    },
    {
      "from": 181.5,
      "to": 183.08,
      "location": 2,
      "content": "พี่คะ"
    },
    {
      "from": 183.5,
      "to": 185.12,
      "location": 2,
      "content": "พี่"
    },
    {
      "from": 186.63,
      "to": 187.88,
      "location": 2,
      "content": "พี่คะ"
    },
    {
      "from": 193.72,
      "to": 195.38,
      "location": 2,
      "content": "พี่"
    },
    {
      "from": 196.8,
      "to": 199.31,
      "location": 2,
      "content": "โธ่ ตื่นได้แล้ว"
    },
    {
      "from": 199.81,
      "to": 201.35,
      "location": 2,
      "content": "พี่"
    },
    {
      "from": 203.81,
      "to": 206.333,
      "location": 2,
      "content": "ถ้าไม่รีบตื่น เดี๋ยวจะไปซ้อมตอนเช้าสายเอานะ"
    },
    {
      "from": 206.52,
      "to": 208.11,
      "location": 2,
      "content": "เอ๊ะ ถามจริงดิ"
    },
    {
      "from": 222.75,
      "to": 223.766,
      "location": 2,
      "content": "ไปก่อนนะครับ"
    },
    {
      "from": 224.58,
      "to": 226.33,
      "location": 2,
      "content": "ไปดีมาดีนะคะ"
    },
    {
      "from": 250.83,
      "to": 252.2,
      "location": 2,
      "content": "(Digimon Adventure Tri)"
    },
    {
      "from": 252.53,
      "to": 255.733,
      "location": 2,
      "content": "(บทที่ 1 การพบกันอีกครั้ง)"
    },
    {
      "from": 291.041,
      "to": 291.441,
      "location": 2,
      "content": "(แต่ว่า)"
    },
    {
      "from": 346.04,
      "to": 347.12,
      "location": 2,
      "content": "เอาละ!"
    },
    {
      "from": 348.41,
      "to": 349.75,
      "location": 2,
      "content": "มาลุยกันต่อเลย"
    },
    {
      "from": 349.96,
      "to": 351.8,
      "location": 2,
      "content": "นายนี่แรงดีชะมัด"
    },
    {
      "from": 352.21,
      "to": 354.63,
      "location": 2,
      "content": "เอาน่า พักสักหน่อยเถอะ"
    },
    {
      "from": 367.06,
      "to": 368.89,
      "location": 2,
      "content": "อ้าว  ฮิคาริ"
    },
    {
      "from": 369.48,
      "to": 371.64,
      "location": 2,
      "content": "พี่ นี่ของที่ลืมไว้"
    },
    {
      "from": 371.85,
      "to": 373.65,
      "location": 2,
      "content": "โทษที ขอบใจนะ"
    },
    {
      "from": 373.85,
      "to": 376,
      "location": 2,
      "content": "ของตอบแทนเอาเป็นไอศกรีมที่ร้านสะดวกซื้อนะ"
    },
    {
      "from": 376.48,
      "to": 378.231,
      "location": 2,
      "content": "\"ไฮเปอร์ทรอปิคัลเอสเพรสโซ่\""
    },
    {
      "from": 378.255,
      "to": 381.9,
      "location": 2,
      "content": "สินค้าเฉพาะฤดูกาล\nที่เป็นสตรอว์เบอร์รี่ช็อกโกบอมเบอร์ครัช"
    },
    {
      "from": 382.2,
      "to": 384.66,
      "location": 2,
      "content": "จ้ะ ๆ รู้แล้วจ้ะ"
    },
    {
      "from": 384.66,
      "to": 384.666,
      "location": 2,
      "content": "จ้ะ ๆ รู้แล้วจ้ะ\nไทจิ!"
    },
    {
      "from": 384.666,
      "to": 385.83,
      "location": 2,
      "content": "ไทจิ!"
    },
    {
      "from": 386.41,
      "to": 387.87,
      "location": 2,
      "content": "มาซ้อมต่อเร็วเข้า"
    },
    {
      "from": 388.866,
      "to": 390.533,
      "location": 2,
      "content": "เมื่อกี้นายบอกว่าให้พักนี่นา"
    },
    {
      "from": 390.58,
      "to": 392.933,
      "location": 2,
      "content": "พวกเราไม่มีเวลาให้หยุดพักสักหน่อย"
    },
    {
      "from": 393.29,
      "to": 395.3,
      "location": 2,
      "content": "ต้องก้าวไปข้างหน้าอย่างสม่ำเสมอเท่านั้น"
    },
    {
      "from": 395.4,
      "to": 396.21,
      "location": 2,
      "content": "ใช่ไหม คุณฮิคาริ"
    },
    {
      "from": 396.42,
      "to": 397.17,
      "location": 2,
      "content": "เอ๊ะ?"
    },
    {
      "from": 397.71,
      "to": 401.72,
      "location": 2,
      "content": "เอ่อ... ใช่แล้วค่ะ ตั้งใจซ้อมกันนะคะ"
    },
    {
      "from": 421.61,
      "to": 423.32,
      "location": 2,
      "content": "วันอาทิตย์นี้เหรอ"
    },
    {
      "from": 423.9,
      "to": 424.7,
      "location": 2,
      "content": "ใช่แล้ว"
    },
    {
      "from": 426.62,
      "to": 428.12,
      "location": 2,
      "content": "อ๊ะ อรุณสวัสดิ์"
    },
    {
      "from": 429.45,
      "to": 430.24,
      "location": 2,
      "content": "อรุณสวัสดิ์"
    },
    {
      "from": 430.45,
      "to": 431.29,
      "location": 2,
      "content": "ว่าไง"
    },
    {
      "from": 439.42,
      "to": 441.233,
      "location": 2,
      "content": "อรุณสวัสดิ์ ยางามิ"
    },
    {
      "from": 441.5,
      "to": 443.466,
      "location": 2,
      "content": "อะ.. อรุณสวัสดิ์ครับ"
    },
    {
      "from": 443.6,
      "to": 445.6,
      "location": 2,
      "content": "นายไม่ได้เอามาส่งอีกแล้วใช่ไหม"
    },
    {
      "from": 445.733,
      "to": 448.8,
      "location": 2,
      "content": "เอ๊ะ? เอ่อ.. ขอโทษด้วยครับ"
    },
    {
      "from": 448.97,
      "to": 451.18,
      "location": 2,
      "content": "เหลือแค่นายคนเดียวแล้วนะ"
    },
    {
      "from": 451.39,
      "to": 456.23,
      "location": 2,
      "content": "ให้ตายสิ มาที่ห้องพักครูช่วงพักกลางวันด้วยล่ะ"
    },
    {
      "from": 457.06,
      "to": 457.9,
      "location": 2,
      "content": "คำตอบล่ะ"
    },
    {
      "from": 457.98,
      "to": 460.233,
      "location": 2,
      "content": "เข้าใจแล้ว ผมเข้าใจแล้วครับ"
    },
    {
      "from": 463.49,
      "to": 464.733,
      "location": 2,
      "content": "อะไรเหรอ"
    },
    {
      "from": 464.9,
      "to": 466.45,
      "location": 2,
      "content": "ใบเลือกเส้นทางในอนาคตน่ะ"
    },
    {
      "from": 466.66,
      "to": 468.95,
      "location": 2,
      "content": "เอ๊ะ ยังไม่ได้ส่งอีกเหรอเนี่ย"
    },
    {
      "from": 469.16,
      "to": 470.41,
      "location": 2,
      "content": "อืม"
    },
    {
      "from": 471.766,
      "to": 474.71,
      "location": 2,
      "content": "งั้นก็รีบส่งใบเส้นทางในอนาคตไปซะสิ"
    },
    {
      "from": 474.91,
      "to": 475.83,
      "location": 2,
      "content": "เออ"
    },
    {
      "from": 501.11,
      "to": 503.32,
      "location": 2,
      "content": "คอนเสิร์ตไง นายจะมาดูด้วยไหม"
    },
    {
      "from": 503.53,
      "to": 505.366,
      "location": 2,
      "content": "วง TEEN AGE WOLVES น่ะเหรอ"
    },
    {
      "from": 505.4,
      "to": 507.433,
      "location": 2,
      "content": "วงแตกก็เลยเปลี่ยนชื่อใหม่ไปแล้ว"
    },
    {
      "from": 507.53,
      "to": 508.32,
      "location": 2,
      "content": "ชื่ออะไรล่ะ"
    },
    {
      "from": 508.53,
      "to": 509.87,
      "location": 2,
      "content": "KNIFE OF DAY"
    },
    {
      "from": 516.16,
      "to": 518.366,
      "location": 2,
      "content": "ที่บอกว่าวงแตกนี่มีเรื่องอะไรกันหรือเปล่า"
    },
    {
      "from": 518.67,
      "to": 520.833,
      "location": 2,
      "content": "ประมาณว่าแนวดนตรีต่างกันมั้ง"
    },
    {
      "from": 520.96,
      "to": 523.38,
      "location": 2,
      "content": "แหม แนวดนตรีเนี่ยนะ"
    },
    {
      "from": 525.16,
      "to": 526.3,
      "location": 2,
      "content": "อย่าเลยน่า"
    },
    {
      "from": 526.533,
      "to": 529.3,
      "location": 2,
      "content": "ขืนฉันอ้วกเอาข้าวราดหน้าพิเศษออกมา\nจะทำยังไง"
    },
    {
      "from": 530.85,
      "to": 534.64,
      "location": 2,
      "content": "อ๊ะ วันอาทิตย์ฉันมีแข่งฟุตบอลน่ะ"
    },
    {
      "from": 534.85,
      "to": 537.48,
      "location": 2,
      "content": "งั้นเหรอ... ช่างมันเถอะ"
    },
    {
      "from": 539.19,
      "to": 540.48,
      "location": 2,
      "content": "หยิบไอ้นั่นให้ที"
    },
    {
      "from": 545.32,
      "to": 546.1,
      "location": 2,
      "content": "สต็อป!"
    },
    {
      "from": 546.24,
      "to": 548.3,
      "location": 2,
      "content": "เขาเรียกว่าเซอร์วิสต่างหาก เซอร์วิสไง"
    },
    {
      "from": 548.36,
      "to": 549.74,
      "location": 2,
      "content": "หยุดเลยนะเฮ้ย"
    },
    {
      "from": 551.633,
      "to": 553.99,
      "location": 2,
      "content": "อย่าเล่นไร้สาระสิ"
    },
    {
      "from": 554.24,
      "to": 557,
      "location": 2,
      "content": "พริกไทยต้องใส่ในปริมาณที่เหมาะสมต่างหาก"
    },
    {
      "from": 557.2,
      "to": 558.7,
      "location": 2,
      "content": "ฉันพิถีพิถันกับการกินราเม็งนะ"
    },
    {
      "from": 558.8,
      "to": 560.5,
      "location": 2,
      "content": "สมกับที่เป็นวง KNIFE OF RAMEN"
    },
    {
      "from": 560.533,
      "to": 561.2,
      "location": 2,
      "content": "หนวกหู!"
    },
    {
      "from": 566.76,
      "to": 569,
      "location": 2,
      "content": "แล้วนายจะเอายังไง ยางามิ"
    },
    {
      "from": 569.68,
      "to": 570.97,
      "location": 2,
      "content": "คงจะวางแผนไว้แล้วใช่ไหม"
    },
    {
      "from": 571.18,
      "to": 573.68,
      "location": 2,
      "content": "อนาคต...สินะ"
    },
    {
      "from": 575.43,
      "to": 576.89,
      "location": 2,
      "content": "ก็ไม่มีอะไรหรอก"
    },
    {
      "from": 579.533,
      "to": 583.266,
      "location": 2,
      "content": "อ่า ขอโทษครับ ผมกินเจ้านี่ได้ไหมครับ"
    },
    {
      "from": 583.4,
      "to": 585.066,
      "location": 2,
      "content": "ก็กินไปแล้วนี่นา"
    },
    {
      "from": 585.533,
      "to": 586.6,
      "location": 2,
      "content": "เอาเถอะ"
    },
    {
      "from": 587.78,
      "to": 589.19,
      "location": 2,
      "content": "ผมกินเลยนะครับ"
    },
    {
      "from": 589.61,
      "to": 592.756,
      "location": 2,
      "content": "ถ้างั้นเอาเป็นสิ่งที่นายอยากทำตอนนี้แล้วกัน"
    },
    {
      "from": 592.78,
      "to": 594.53,
      "location": 2,
      "content": "มันต้องมีสักอย่างสิ"
    },
    {
      "from": 594.91,
      "to": 596.74,
      "location": 2,
      "content": "ผมคิดไม่ค่อยออกเลยครับ"
    },
    {
      "from": 596.95,
      "to": 599.366,
      "location": 2,
      "content": "ลองพูดเท่าที่จะนึกออกดูหน่อย"
    },
    {
      "from": 601.21,
      "to": 604.04,
      "location": 2,
      "content": "ถ้างั้น... ผมอยากเจอกับเพื่อน"
    },
    {
      "from": 607.13,
      "to": 610.05,
      "location": 2,
      "content": "เขาอยู่ในสถานที่ห่างไกลและไม่สามารถไปได้ครับ"
    },
    {
      "from": 610.97,
      "to": 613.64,
      "location": 2,
      "content": "ถึงเมื่อก่อนจะเคยไปบ่อยก็เถอะ"
    },
    {
      "from": 615.64,
      "to": 617.366,
      "location": 2,
      "content": "(ต่างประเทศ)"
    },
    {
      "from": 617.533,
      "to": 619.96,
      "location": 2,
      "content": "ก็นะ ประมาณนั้นแหละครับ"
    },
    {
      "from": 619.966,
      "to": 623.02,
      "location": 2,
      "content": "ถ้างั้นเริ่มจากเรียนภาษาก่อนเลยเป็นไง"
    },
    {
      "from": 623.23,
      "to": 624.94,
      "location": 2,
      "content": "โรงเรียนที่เปิดสอนก็มีอยู่เยอะ"
    },
    {
      "from": 625.15,
      "to": 628.366,
      "location": 2,
      "content": "ไว้ค่อยหาสิ่งที่อยากทำหลังเรียนต่อก็ได้"
    },
    {
      "from": 632.61,
      "to": 635.24,
      "location": 2,
      "content": "(ความฝัน)\n- ความฝันนั้นช่างยิ่งใหญ่"
    },
    {
      "from": 688.04,
      "to": 689.71,
      "location": 2,
      "content": "โคชิโร่"
    },
    {
      "from": 693.84,
      "to": 694.97,
      "location": 2,
      "content": "ขอโทษด้วยนะครับ"
    },
    {
      "from": 695.3,
      "to": 696.4,
      "location": 2,
      "content": "อุตส่าห์ชวนผมทั้งที"
    },
    {
      "from": 696.4,
      "to": 698.86,
      "location": 2,
      "content": "แต่วันนั้นตรงกับ\nวันครบรอบแต่งงานของพ่อแม่พอดีเลย"
    },
    {
      "from": 698.89,
      "to": 700.9,
      "location": 2,
      "content": "งั้นเหรอ มาไม่ได้สินะ"
    },
    {
      "from": 701.03,
      "to": 702.333,
      "location": 2,
      "content": "แล้วพวกคุณยามาโตะล่ะ"
    },
    {
      "from": 702.47,
      "to": 704.02,
      "location": 2,
      "content": "วันนั้นเขามีเล่นคอนเสิร์ตน่ะ"
    },
    {
      "from": 704.23,
      "to": 707.31,
      "location": 2,
      "content": "โจเองก็อ่านหนังสือเตรียมสอบ\nคงจะชวนเขาลำบากด้วย"
    },
    {
      "from": 707.56,
      "to": 710.7,
      "location": 2,
      "content": "ว่าจะลองชวนฮิคาริกับทาเครุดู\nไม่รู้จะว่างไหมนะ"
    },
    {
      "from": 710.73,
      "to": 713.69,
      "location": 2,
      "content": "หมู่นี้เรามารวมตัวกันไม่ค่อยได้เลยนะครับ"
    },
    {
      "from": 713.9,
      "to": 715.4,
      "location": 2,
      "content": "ไม่เป็นไรหรอก"
    },
    {
      "from": 716.41,
      "to": 720.03,
      "location": 2,
      "content": "แบบว่านึกขึ้นได้ก็เลยลองถามดูเท่านั้นเอง"
    },
    {
      "from": 720.24,
      "to": 722.2,
      "location": 2,
      "content": "อ๊ะ จริงด้วยสิ"
    },
    {
      "from": 722.41,
      "to": 725.533,
      "location": 2,
      "content": "ลองเมลถามคุณมีมี่ไหมครับ เผื่อเขาไปได้ไง"
    },
    {
      "from": 725.566,
      "to": 727.7,
      "location": 2,
      "content": "เห เธออยู่ตั้งอเมริกาเชียวนะ"
    },
    {
      "from": 727.92,
      "to": 730.17,
      "location": 2,
      "content": "เป็นไปไม่ได้หรอก ต้องมาไม่ได้แหง"
    },
    {
      "from": 730.38,
      "to": 734.166,
      "location": 2,
      "content": "แต่ถ้าเป็นคุณมีมี่ เธอก็อาจจะยอมมาง่าย ๆ\nแบบคาดไม่ถึงก็ได้นะครับ"
    },
    {
      "from": 735.26,
      "to": 738.01,
      "location": 2,
      "content": "ยัยนั่นกำลังทำอะไรอยู่กันนะ"
    },
    {
      "from": 738.34,
      "to": 741.01,
      "location": 2,
      "content": "อ๊ะ ตอบมาแล้ว เร็วมาก"
    },
    {
      "from": 741.22,
      "to": 742.01,
      "location": 2,
      "content": "ฮัลโหล"
    },
    {
      "from": 742.35,
      "to": 747.31,
      "location": 2,
      "content": "ขอบคุณที่ชวนนะ\nเดี๋ยวจะไปเบิกค่าเครื่องบินแล้วกัน ฝากด้วยละ"
    },
    {
      "from": 747.52,
      "to": 748.52,
      "location": 2,
      "content": "จากมีมี่"
    },
    {
      "from": 749.27,
      "to": 751.02,
      "location": 2,
      "content": "เอ๋ บอกว่าจะมาเหรอ"
    },
    {
      "from": 751.23,
      "to": 755.8,
      "location": 2,
      "content": "คุณไทจิ ตั๋วเครื่องบินไปกลับนิวยอร์ก-โตเกียว\nของสัปดาห์นี้น่ะ"
    },
    {
      "from": 755.94,
      "to": 758.466,
      "location": 2,
      "content": "ค่าโดยสารตามปกติอยู่ที่\n1,080,000 เยนเลยนะครับ"
    },
    {
      "from": 758.95,
      "to": 762.74,
      "location": 2,
      "content": "(ตารางค่าโดยสาร)\nช่วงนี้แต่ละสายการบิน\nจะมีค่าโดยสารเสริมพิเศษเป็นค่าเชื้อเพลิง"
    },
    {
      "from": 762.95,
      "to": 766,
      "location": 2,
      "content": "เพราะมีการคิดค่าธรรมเนียมเชื้อเพลิงเข้าไปด้วย"
    },
    {
      "from": 766.166,
      "to": 768.37,
      "location": 2,
      "content": "เขาเลยเอาค่าใช้จ่ายไปคิดรวมกับราคาตรงนี้ครับ"
    },
    {
      "from": 768.633,
      "to": 772,
      "location": 2,
      "content": "ผมลองแสดงตารางเปรียบเทียบราคา\nของแต่ละสายการบินออกมาตรงนี้แล้วครับ"
    },
    {
      "from": 772.29,
      "to": 773.5,
      "location": 2,
      "content": "เอ่อ แต่ว่า..."
    },
    {
      "from": 773.71,
      "to": 777.88,
      "location": 2,
      "content": "ถ้าเป็นคุณมีมี่ละก็\nเราควรจะเช็กราคาบิสเนสคลาสเผื่อไว้ดีกว่ามั้ง"
    },
    {
      "from": 778.09,
      "to": 779.55,
      "location": 2,
      "content": "ช่างมันเถอะ"
    },
    {
      "from": 780.76,
      "to": 783.22,
      "location": 2,
      "content": "ขอโทษนะ วันอาทิตย์มีนัดแล้วน่ะ"
    },
    {
      "from": 783.43,
      "to": 785.4,
      "location": 2,
      "content": "งั้นเหรอ มาไม่ได้สินะ"
    },
    {
      "from": 785.47,
      "to": 787.77,
      "location": 2,
      "content": "ว่าจะไปดูคอนเสิร์ตของพี่กับเพื่อนน่ะ"
    },
    {
      "from": 787.98,
      "to": 789.77,
      "location": 2,
      "content": "เพื่อนที่ว่านี่เป็นผู้หญิงเหรอ"
    },
    {
      "from": 789.98,
      "to": 790.98,
      "location": 2,
      "content": "ใช่แล้ว"
    },
    {
      "from": 795.65,
      "to": 798.9,
      "location": 2,
      "content": "แหม ทาเครุคุงเนื้อหอมจังนะ"
    },
    {
      "from": 799.066,
      "to": 802.07,
      "location": 2,
      "content": "ไม่ใช่แบบนั้นหรอก แค่เพื่อนธรรมดาเอง"
    },
    {
      "from": 803.74,
      "to": 805.2,
      "location": 2,
      "content": "เอ๊ะ อะไรเหรอ"
    },
    {
      "from": 806.033,
      "to": 807.12,
      "location": 2,
      "content": "เปล่าสักหน่อย"
    },
    {
      "from": 807.33,
      "to": 808.33,
      "location": 2,
      "content": "อะไรกันล่ะ"
    },
    {
      "from": 809,
      "to": 811.25,
      "location": 2,
      "content": "ฮิคาริจังหึงงั้นเหรอ"
    },
    {
      "from": 812,
      "to": 813.34,
      "location": 2,
      "content": "จะเป็นไปได้ยังไงกัน"
    },
    {
      "from": 815,
      "to": 819.13,
      "location": 2,
      "content": "พอไม่มีใครไปเชียร์เขาแบบนี้\nพี่ก็เหมือนจะซึมไปเลยแหละ"
    },
    {
      "from": 819.34,
      "to": 822.9,
      "location": 2,
      "content": "จริง ๆ แล้วพี่ชายผม\nก็ดูอยากจะให้ทุกคนมาคอนเสิร์ตเหมือนกันนะ"
    },
    {
      "from": 822.97,
      "to": 823.89,
      "location": 2,
      "content": "งั้นเหรอ"
    },
    {
      "from": 824.1,
      "to": 827.266,
      "location": 2,
      "content": "เรื่องแบบนี้เขาไม่พูดออกมาหรอก"
    },
    {
      "from": 827.68,
      "to": 830.6,
      "location": 2,
      "content": "พวกเราต่างก็หนักใจ\nเรื่องพี่ชายกันทั้งคู่เลยเนอะ"
    },
    {
      "from": 832.31,
      "to": 833.466,
      "location": 2,
      "content": "ไว้มาชวนใหม่นะ"
    },
    {
      "from": 833.86,
      "to": 835.32,
      "location": 2,
      "content": "อืม บ๊ายบาย"
    },
    {
      "from": 864.266,
      "to": 868.14,
      "location": 2,
      "content": "ผลสอบของโรงเรียนได้ประกาศออกมาแล้ว\nเราจะมาเปลี่ยนที่นั่งกันนะครับ"
    },
    {
      "from": 868.266,
      "to": 871.52,
      "location": 2,
      "content": "ช่วยนั่งเรียงตามลำดับผลการเรียน\nตั้งแต่แถวหน้าด้วยครับ"
    },
    {
      "from": 875.56,
      "to": 879.32,
      "location": 2,
      "content": "สำหรับห้องเรา คนที่นั่งจากแถวสี่ลงไป\nก็แสดงว่าถูกประเมินได้เกรด D ครับ"
    },
    {
      "from": 879.65,
      "to": 883.366,
      "location": 2,
      "content": "ต่อจากนี้ไป นักเรียนที่นั่งแถวหลัง\nก็พยายามกันให้มากขึ้นนะครับ"
    },
    {
      "from": 885.32,
      "to": 887.08,
      "location": 2,
      "content": "แถวที่สี่..."
    },
    {
      "from": 888.866,
      "to": 891.366,
      "location": 2,
      "content": "(ผลจำลองสอบเข้ามหาวิทยาลัย)"
    },
    {
      "from": 899.59,
      "to": 903.51,
      "location": 2,
      "content": "(ขอโทษที ต้องอ่านหนังสือสอบ ขอโทษด้วยนะ)"
    },
    {
      "from": 908.68,
      "to": 911.52,
      "location": 2,
      "content": "ใช่ เริ่มมีผู้เห็นเหตุการณ์โผล่ออกมาแล้ว"
    },
    {
      "from": 911.85,
      "to": 913.02,
      "location": 2,
      "content": "เข้าใจแล้วครับ"
    },
    {
      "from": 913.35,
      "to": 917.61,
      "location": 2,
      "content": "ถึงจะยังไม่เกิดความเสียหายอะไร\nแต่คงจะอีกไม่นานแล้ว"
    },
    {
      "from": 917.86,
      "to": 919.19,
      "location": 2,
      "content": "ระวังตัวด้วยละ"
    },
    {
      "from": 926.03,
      "to": 927.28,
      "location": 2,
      "content": "(นอกเขตสัญญาณ)"
    },
    {
      "from": 927.49,
      "to": 928.53,
      "location": 2,
      "content": "ชิ!"
    },
    {
      "from": 935.533,
      "to": 938.79,
      "location": 2,
      "content": "ขณะนี้มีเหตุการณ์ไฟฟ้าดับเป็นวงกว้าง\nเกิดขึ้นอยู่บ่อยครั้งในภูมิภาคคันโต..."
    },
    {
      "from": 939.1,
      "to": 941.3,
      "location": 2,
      "content": "ขอโทษที่หนูไปเชียร์ไม่ได้นะ"
    },
    {
      "from": 941.8,
      "to": 944.166,
      "location": 2,
      "content": "เอาเถอะ อย่าคิดมากเลย"
    },
    {
      "from": 944.72,
      "to": 947.14,
      "location": 2,
      "content": "เป็นวันเกิดของใครสักคนไม่ใช่เหรอ"
    },
    {
      "from": 947.766,
      "to": 948.433,
      "location": 2,
      "content": "อืม"
    },
    {
      "from": 950.39,
      "to": 955.033,
      "location": 2,
      "content": "เนื่องจากเวลาและสถานที่เกิดสัญญาณ\nรบกวนคลื่นไฟฟ้าต่อเนื่องมีความคาบเกี่ยวกัน"
    },
    {
      "from": 955.3,
      "to": 957.933,
      "location": 2,
      "content": "จึงบ่งชี้ให้เห็นถึงความเป็นไปได้ว่า\nทั้งสองส่วนอาจมีความสัมพันธ์กันค่ะ"
    },
    {
      "from": 958.133,
      "to": 959.066,
      "location": 2,
      "content": "พี่คะ"
    },
    {
      "from": 959.52,
      "to": 961.4,
      "location": 2,
      "content": "ช่างมันเถอะน่า ไม่เป็นไรหรอก"
    },
    {
      "from": 961.433,
      "to": 964.933,
      "location": 2,
      "content": "มันช่วยไม่ได้นี่นา ทุกคนเองก็ยุ่งกันหมดด้วย"
    },
    {
      "from": 965.53,
      "to": 967.666,
      "location": 2,
      "content": "กะแล้วเชียวว่าพี่ต้องคิดมาก"
    },
    {
      "from": 967.833,
      "to": 968.7,
      "location": 2,
      "content": "เปล่าสักหน่อย"
    },
    {
      "from": 968.74,
      "to": 971.91,
      "location": 2,
      "content": "คิดสิ พี่คิดมากอยู่จริง ๆ แหละ"
    },
    {
      "from": 972.41,
      "to": 974.62,
      "location": 2,
      "content": "หรือต้องบอกว่าพี่ดูเศร้านิดหน่อยหรือเปล่า"
    },
    {
      "from": 974.83,
      "to": 977.25,
      "location": 2,
      "content": "ใครมันจะไปรู้สึกเศร้ากับเรื่องแค่นั้นกัน"
    },
    {
      "from": 978.25,
      "to": 979.333,
      "location": 2,
      "content": "ขอบคุณสำหรับอาหาร"
    },
    {
      "from": 980.42,
      "to": 982.7,
      "location": 2,
      "content": "เดี๋ยวสิ คือว่านะ..."
    },
    {
      "from": 983.2,
      "to": 986.17,
      "location": 2,
      "content": "เธอเองก็ลองมาสัมผัสความสดชื่น\nที่ระเบิดออกมาด้วยสิ"
    },
    {
      "from": 986.55,
      "to": 987.51,
      "location": 2,
      "content": "มีอะไรเหรอ"
    },
    {
      "from": 988.26,
      "to": 991.18,
      "location": 2,
      "content": "เปล่า ไม่มีอะไรหรอก"
    },
    {
      "from": 991.56,
      "to": 993.93,
      "location": 2,
      "content": "ขอให้โชคดีกับการแข่งนะ"
    },
    {
      "from": 1000.76,
      "to": 1005.333,
      "location": 2,
      "content": "(ถึง ทาเคโนะอุจิ โซระ)\n(จะไปดูคอนเสิร์ตของยามาโตะเหรอ?)"
    },
    {
      "from": 1012.1,
      "to": 1012.8,
      "location": 2,
      "content": "(ทำไมเหรอ?)"
    },
    {
      "from": 1012.9,
      "to": 1017.96,
      "location": 2,
      "content": "(ฉันมีแข่งฟุตบอล...)"
    },
    {
      "from": 1021.333,
      "to": 1027.47,
      "location": 2,
      "content": "(ฉันมีแข่งฟุตบอล)\n(เริ่มบ่ายสองโมงที่สนามไดบะโจว...)"
    },
    {
      "from": 1030.566,
      "to": 1033.22,
      "location": 2,
      "content": "(ถ้าเธอพอจะมีเวลา...)"
    },
    {
      "from": 1038.73,
      "to": 1041.933,
      "location": 2,
      "content": "อ่า ต้องขอโทษด้วยครับ\nเดี๋ยวจะหลีกทางให้เดี๋ยวนี้แหละครับ"
    },
    {
      "from": 1050.26,
      "to": 1053.066,
      "location": 2,
      "content": "จะว่าไป\nไทจิก็น่าจะรีบบอกให้เร็วกว่านี้หน่อยสิ"
    },
    {
      "from": 1053.3,
      "to": 1056.12,
      "location": 2,
      "content": "ถ้ารู้ก่อน ฉันจะได้เตรียมตัวให้เร็วกว่านี้"
    },
    {
      "from": 1056.33,
      "to": 1059,
      "location": 2,
      "content": "เอ่อ ฟุตบอลเริ่มแข่งตอนบ่ายสองโมง"
    },
    {
      "from": 1059,
      "to": 1060.5,
      "location": 2,
      "content": "ถึงต่อให้รีบไปยังไง..."
    },
    {
      "from": 1060.79,
      "to": 1063.75,
      "location": 2,
      "content": "ก็ใช้เวลาตั้ง 30 นาที\nกว่าจะไปถึงลานคอนเสิร์ตอยู่ดี"
    },
    {
      "from": 1064.34,
      "to": 1066.09,
      "location": 2,
      "content": "โธ่ ให้ตายสิ"
    },
    {
      "from": 1066.8,
      "to": 1067.7,
      "location": 2,
      "content": "ทำยังไงดี..."
    },
    {
      "from": 1068.433,
      "to": 1070.76,
      "location": 2,
      "content": "ถ้ารีบไปต่อทันทีหลังจากที่ดูแข่งเสร็จละก็..."
    },
    {
      "from": 1071.533,
      "to": 1074.47,
      "location": 2,
      "content": "ว่าแต่ วงของยามาโตะนี่\nขึ้นแสดงเป็นวงที่เท่าไหร่กันนะ"
    },
    {
      "from": 1074.68,
      "to": 1078.033,
      "location": 2,
      "content": "ขืนแสดงเป็นวงแรก\nต่อให้รีบยังไงก็ไปไม่ทันแน่นอน"
    },
    {
      "from": 1078.43,
      "to": 1080.6,
      "location": 2,
      "content": "หรือฉันจะไปดูคอนเสิร์ตก่อนการแข่งดีล่ะ"
    },
    {
      "from": 1081,
      "to": 1085.52,
      "location": 2,
      "content": "ทำอะไรอยู่กันแน่...ตั้งสติหน่อยสิ"
    },
    {
      "from": 1086.53,
      "to": 1090.78,
      "location": 2,
      "content": "เอาจริงนะ\nทำไมฉันถึงต้องมาเครียดขนาดนี้ด้วยเนี่ย"
    },
    {
      "from": 1090.99,
      "to": 1095.28,
      "location": 2,
      "content": "พอกันที ฉันไม่ไปที่ไหนทั้งนั้นแหละ\nเอาตามนั้นแล้วกัน"
    },
    {
      "from": 1097.266,
      "to": 1099.29,
      "location": 2,
      "content": "หวา ไม่มีเวลาแล้ว"
    },
    {
      "from": 1103,
      "to": 1103.633,
      "location": 2,
      "content": "เอ๊ะ?"
    },
    {
      "from": 1104.633,
      "to": 1105.8,
      "location": 2,
      "content": "อะไรน่ะ?"
    },
    {
      "from": 1108.46,
      "to": 1110.3,
      "location": 2,
      "content": "ดูท่าจะมีเรื่องดี ๆ เกิดขึ้นนะ"
    },
    {
      "from": 1110.84,
      "to": 1112.866,
      "location": 2,
      "content": "แต่มันใช่ซะที่ไหนกันเล่า"
    },
    {
      "from": 1115.14,
      "to": 1116.56,
      "location": 2,
      "content": "ลืมมือถือ ๆ"
    },
    {
      "from": 1130.82,
      "to": 1132.32,
      "location": 2,
      "content": "ขออนุญาตสักครู่นะครับ"
    },
    {
      "from": 1133.49,
      "to": 1135.49,
      "location": 2,
      "content": "อ๊ะ ฉันโซระเองจ้ะ"
    },
    {
      "from": 1135.7,
      "to": 1136.633,
      "location": 2,
      "content": "คุณโซระ?"
    },
    {
      "from": 1137.08,
      "to": 1139.66,
      "location": 2,
      "content": "ขอโทษนะ ตอนนี้สะดวกคุยหรือเปล่า"
    },
    {
      "from": 1140.7,
      "to": 1143.866,
      "location": 2,
      "content": "ว่าแต่มีเรื่องอะไรเหรอครับ\nมีธุระเร่งด่วนหรือเปล่า"
    },
    {
      "from": 1144.03,
      "to": 1146.366,
      "location": 2,
      "content": "ก็ใช่น่ะสิ ที่จริงแล้วเมื่อกี้นี้..."
    },
    {
      "from": 1147.351,
      "to": 1148.951,
      "location": 2,
      "content": "ครับ...ครับ"
    },
    {
      "from": 1148.966,
      "to": 1150.34,
      "location": 2,
      "content": "เข้าใจแล้วครับ"
    },
    {
      "from": 1151.05,
      "to": 1152.67,
      "location": 2,
      "content": "ขอซุปหัวหอมครับ"
    },
    {
      "from": 1153.56,
      "to": 1156.268,
      "location": 2,
      "content": "อ๊ะ มือถือเครื่องนี้แปลก ๆ หรือเปล่านะ"
    },
    {
      "from": 1156.292,
      "to": 1159,
      "location": 2,
      "content": "เหมือนได้ยินคำที่คล้ายกับภาษาอังกฤษเลย"
    },
    {
      "from": 1159.2,
      "to": 1162.933,
      "location": 2,
      "content": "อ๋อ สายโทรศัพท์อาจจะพันกันก็ได้ครับ\nครั้งก่อนก็เคยเป็น"
    },
    {
      "from": 1163.1,
      "to": 1166.86,
      "location": 2,
      "content": "เริ่มแรกมันก็จะส่งผลกระทบ\nไปที่สัญญาณสื่อสารกับอุปกรณ์ดิจิทัล"
    },
    {
      "from": 1167.23,
      "to": 1170.566,
      "location": 2,
      "content": "ขออกเป็ดซอสส้มและชาอู่หลงให้เข้าด้วยครับ"
    },
    {
      "from": 1170.69,
      "to": 1171.86,
      "location": 2,
      "content": "รบกวนด้วยนะครับ"
    },
    {
      "from": 1174.78,
      "to": 1176.87,
      "location": 2,
      "content": "อ่า เหมือนจะไม่ได้การ"
    },
    {
      "from": 1177.266,
      "to": 1180.37,
      "location": 2,
      "content": "ฟังไม่รู้เรื่องเลย ไว้ฉันจะโทรมาใหม่นะ"
    },
    {
      "from": 1180.74,
      "to": 1182.733,
      "location": 2,
      "content": "อ้าว คุณโซระ?"
    },
    {
      "from": 1182.91,
      "to": 1183.91,
      "location": 2,
      "content": "ฮัลโหล"
    },
    {
      "from": 1199.39,
      "to": 1201.89,
      "location": 2,
      "content": "ตั๋วขายดีสุด ๆ เลยนะ"
    },
    {
      "from": 1202.27,
      "to": 1205.39,
      "location": 2,
      "content": "ทุกคนตั้งตารอที่จะได้ดูวงใหม่ของพี่เลยละ"
    },
    {
      "from": 1205.94,
      "to": 1210.666,
      "location": 2,
      "content": "วงชื่อว่าอะไรนะ?\nที่ไม่ใช่ TEEN AGE WOLVES น่ะ"
    },
    {
      "from": 1210.77,
      "to": 1212.15,
      "location": 2,
      "content": "KNIFE OF DAY"
    },
    {
      "from": 1214.82,
      "to": 1215.65,
      "location": 2,
      "content": "อ้าว?"
    },
    {
      "from": 1217.95,
      "to": 1219.41,
      "location": 2,
      "content": "แปลกจังแฮะ"
    },
    {
      "from": 1232.42,
      "to": 1234.26,
      "location": 2,
      "content": "นี่มันเกิดอะไรขึ้นเนี่ย"
    },
    {
      "from": 1250.61,
      "to": 1253.82,
      "location": 2,
      "content": "ฉันก็บอกไปแล้วไงว่านายต้องพาฮิคาริจังมาให้ได้"
    },
    {
      "from": 1254.366,
      "to": 1257.45,
      "location": 2,
      "content": "ช่วยไม่ได้นี่หว่า เธอติดธุระนะ"
    },
    {
      "from": 1258.03,
      "to": 1259.03,
      "location": 2,
      "content": "เฮ้"
    },
    {
      "from": 1259.6,
      "to": 1260.95,
      "location": 2,
      "content": "นั่นมันอะไรน่ะ"
    },
    {
      "from": 1272.54,
      "to": 1274.21,
      "location": 2,
      "content": "เฮ้ย ไทจิ"
    },
    {
      "from": 1274.55,
      "to": 1275.71,
      "location": 2,
      "content": "เอ๊ะ?"
    },
    {
      "from": 1276.21,
      "to": 1278.43,
      "location": 2,
      "content": "เฮ้ ฮัลโหล"
    },
    {
      "from": 1278.63,
      "to": 1280.93,
      "location": 2,
      "content": "ทำไมถึงโทรไม่ติดเลยล่ะ"
    },
    {
      "from": 1281.14,
      "to": 1283.72,
      "location": 2,
      "content": "หม่าม้า มีอะไรบางอย่างแปลก ๆ ด้วย"
    },
    {
      "from": 1290.166,
      "to": 1292.23,
      "location": 2,
      "content": "นี่มันเกิดอะไรขึ้นเนี่ย"
    },
    {
      "from": 1301.24,
      "to": 1303.33,
      "location": 2,
      "content": "ทำไมคุวากามอนถึงอยู่ที่นี่..."
    },
    {
      "from": 1306.33,
      "to": 1309.71,
      "location": 2,
      "content": "มีจัดถึงสุดสัปดาห์นี้ค่ะ\nน่าตื่นเต้นจังเลยนะคะ"
    },
    {
      "from": 1309.91,
      "to": 1311.933,
      "location": 2,
      "content": "ขณะนี้มีข่าวด่วนแทรกเข้ามาค่ะ"
    },
    {
      "from": 1312.33,
      "to": 1316.25,
      "location": 2,
      "content": "มีสิ่งมีชีวิตที่ไม่สามารถระบุได้\nปรากฏตัวขึ้นเหนือท้องฟ้าของโอไดบะในโตเกียวค่ะ"
    },
    {
      "from": 1316.67,
      "to": 1320.9,
      "location": 2,
      "content": "อีกทั้งยังเกิดสัญญาณรบกวน\nคลื่นไฟฟ้าเป็นวงกว้างในบริเวณโอไดบะ"
    },
    {
      "from": 1321.066,
      "to": 1323.908,
      "location": 2,
      "content": "จึงส่งผลให้การจราจรติดขัด\nเนื่องจากสัญญาณไฟจราจรขัดข้อง"
    },
    {
      "from": 1323.932,
      "to": 1325.4,
      "location": 2,
      "content": "และเส้นทางคมนาคมเกิดปัญหาค่ะ"
    },
    {
      "from": 1325.633,
      "to": 1326.93,
      "location": 2,
      "content": "อย่าบอกนะว่านี่มัน..."
    },
    {
      "from": 1327.6,
      "to": 1328.93,
      "location": 2,
      "content": "ผมก็ว่างั้นแหละ"
    },
    {
      "from": 1331.6,
      "to": 1334.366,
      "location": 2,
      "content": "ฮัลโหล คือว่าคอนเสิร์ตวันนี้น่ะ..."
    },
    {
      "from": 1334.69,
      "to": 1336.44,
      "location": 2,
      "content": "เหมือนจะถูกยกเลิกแล้ว"
    },
    {
      "from": 1337.44,
      "to": 1338.9,
      "location": 2,
      "content": "ต้องขอโทษจริง ๆ นะ"
    },
    {
      "from": 1339.4,
      "to": 1340.74,
      "location": 2,
      "content": "อืม ไว้ค่อยคุยกัน"
    },
    {
      "from": 1340.95,
      "to": 1342.53,
      "location": 2,
      "content": "แฟนสาวเหรอ"
    },
    {
      "from": 1342.86,
      "to": 1344.266,
      "location": 2,
      "content": "อย่าห่วงไปเลย"
    },
    {
      "from": 1344.37,
      "to": 1347.66,
      "location": 2,
      "content": "ไม่ต้องกังวลหรอก\nยังไงผมก็รักพี่ที่สุดอยู่แล้ว"
    },
    {
      "from": 1347.87,
      "to": 1350.04,
      "location": 2,
      "content": "พูดอะไรของนายเนี่ย จริง ๆ เลย"
    },
    {
      "from": 1353.21,
      "to": 1355.34,
      "location": 2,
      "content": "โทรหาไทจิไม่ติดเลย"
    },
    {
      "from": 1355.54,
      "to": 1357,
      "location": 2,
      "content": "เขาแข่งอยู่ไม่ใช่เหรอ"
    },
    {
      "from": 1357.21,
      "to": 1358.63,
      "location": 2,
      "content": "อ๊ะ ฮัลโหล"
    },
    {
      "from": 1359.88,
      "to": 1362.13,
      "location": 2,
      "content": "คือว่า  คอนเสิร์ตวันนี้น่ะ..."
    },
    {
      "from": 1396.88,
      "to": 1399.666,
      "location": 2,
      "content": "ขอโทษนะครับ ขอชาอู่หลงเพิ่มด้วยครับ"
    },
    {
      "from": 1407.85,
      "to": 1409.9,
      "location": 2,
      "content": "โธ่ ทำไมล่ะ"
    },
    {
      "from": 1410.39,
      "to": 1411.73,
      "location": 2,
      "content": "ทำไมกันล่ะ"
    },
    {
      "from": 1429.08,
      "to": 1430.666,
      "location": 2,
      "content": "โธ่ ใช้ไม่ได้เลย"
    },
    {
      "from": 1440.92,
      "to": 1442.55,
      "location": 2,
      "content": "(นอกเขตสัญญาณ)"
    },
    {
      "from": 1457.02,
      "to": 1458,
      "location": 2,
      "content": "เจอแล้ว!"
    },
    {
      "from": 1549.36,
      "to": 1550.833,
      "location": 2,
      "content": "เรื่องจริงเหรอเนี่ย"
    },
    {
      "from": 1638.08,
      "to": 1639.41,
      "location": 2,
      "content": "ไม่มีประโยชน์"
    },
    {
      "from": 1643.96,
      "to": 1646.96,
      "location": 2,
      "content": "ลำพังแค่ฉันคนเดียวทำอะไรมันไม่ได้เลย"
    },
    {
      "from": 1678.41,
      "to": 1680.2,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 1681.29,
      "to": 1684.66,
      "location": 2,
      "content": "อากูมอน! ไม่ได้เจอกันนานเลย"
    },
    {
      "from": 1685.08,
      "to": 1687.63,
      "location": 2,
      "content": "ไทจิ ตัวโตขึ้นแล้วนะ"
    },
    {
      "from": 1687.83,
      "to": 1690.21,
      "location": 2,
      "content": "นายก็ตัวเล็กลงแล้วนะ"
    },
    {
      "from": 1691.966,
      "to": 1693.34,
      "location": 2,
      "content": "ไม่ใช่เวลามาคุยกันสักหน่อย"
    },
    {
      "from": 1696.72,
      "to": 1699.733,
      "location": 2,
      "content": "อากูมอน พวกเรามาหยุดการอาละวาดของเจ้านั่นกัน"
    },
    {
      "from": 1700,
      "to": 1700.86,
      "location": 2,
      "content": "เข้าใจแล้ว"
    },
    {
      "from": 1713.94,
      "to": 1717.07,
      "location": 2,
      "content": "อากูมอน เปลี่ยนร่าง"
    },
    {
      "from": 1738.433,
      "to": 1739.72,
      "location": 2,
      "content": "เกรย์มอน"
    },
    {
      "from": 1751.7,
      "to": 1755.69,
      "location": 2,
      "content": "ไทจิ\nเจ้านั่นแข็งแกร่งขึ้นกว่าตอนที่สู้กันครั้งก่อนอีก"
    },
    {
      "from": 1755.9,
      "to": 1756.86,
      "location": 2,
      "content": "หมายความว่ายังไงกัน"
    },
    {
      "from": 1757,
      "to": 1758.15,
      "location": 2,
      "content": "ยังไงผมก็จะหยุดมันก่อน"
    },
    {
      "from": 1758.36,
      "to": 1759.9,
      "location": 2,
      "content": "ฝากด้วยนะ เกรย์มอน"
    },
    {
      "from": 1778.09,
      "to": 1779.26,
      "location": 2,
      "content": "หายไปแล้ว"
    },
    {
      "from": 1813.17,
      "to": 1815.09,
      "location": 2,
      "content": "เกรย์มอน!"
    },
    {
      "from": 1815.96,
      "to": 1819.47,
      "location": 2,
      "content": "เฮ้! อยู่ที่ไหน"
    },
    {
      "from": 1822.433,
      "to": 1823.3,
      "location": 2,
      "content": "ฮิคาริ"
    },
    {
      "from": 1823.3,
      "to": 1824.7,
      "location": 2,
      "content": "เกิดเรื่องใหญ่แล้ว พี่"
    },
    {
      "from": 1825.14,
      "to": 1828.22,
      "location": 2,
      "content": "ข่าวบอกด้วยว่ามีดิจิมอนโผล่มา\nที่สนามบินฮาเนดะน่ะ"
    },
    {
      "from": 1828.43,
      "to": 1829.81,
      "location": 2,
      "content": "ฮาเนดะเหรอ?"
    },
    {
      "from": 1831.06,
      "to": 1834.02,
      "location": 2,
      "content": "แล้วจะไปที่ฮาเนดะยังไงดีล่ะ"
    },
    {
      "from": 1836.36,
      "to": 1838.48,
      "location": 2,
      "content": "จริงสิ ฮิคาริ เธอเองก็..."
    },
    {
      "from": 1842.66,
      "to": 1843.45,
      "location": 2,
      "content": "อะไรเหรอ"
    },
    {
      "from": 1843.66,
      "to": 1845.45,
      "location": 2,
      "content": "เปล่า ไม่มีอะไร"
    },
    {
      "from": 1845.66,
      "to": 1847.12,
      "location": 2,
      "content": "ขอบคุณนะ ช่วยได้มากเลย"
    },
    {
      "from": 1847.33,
      "to": 1848.49,
      "location": 2,
      "content": "เดี๋ยวสิ พี่..."
    },
    {
      "from": 1849.75,
      "to": 1850.87,
      "location": 2,
      "content": "ยางามิ!"
    },
    {
      "from": 1854,
      "to": 1855.5,
      "location": 2,
      "content": "อาจารย์นิชิจิมะ?"
    },
    {
      "from": 1855.84,
      "to": 1856.67,
      "location": 2,
      "content": "ขึ้นมาเลย!"
    },
    {
      "from": 1862.51,
      "to": 1864.333,
      "location": 2,
      "content": "คุณยางามิ ฮิคาริ สินะครับ"
    },
    {
      "from": 1866.999,
      "to": 1868.999,
      "location": 2,
      "content": "(ตารางเที่ยวบิน ถูกยกเลิก)"
    },
    {
      "from": 1875.433,
      "to": 1876.69,
      "location": 2,
      "content": "เฮ้ย เกิดอะไรขึ้นกันแน่เนี่ย"
    },
    {
      "from": 1888.24,
      "to": 1890.41,
      "location": 2,
      "content": "ถึงศูนย์บัญชาการหลัก\nทางนี้อยู่ที่สะพานเบ็งเท็น"
    },
    {
      "from": 1890.7,
      "to": 1892.16,
      "location": 2,
      "content": "ศูนย์บัญชาการหลัก รับเรื่อง\nทราบแล้วเปลี่ยน"
    },
    {
      "from": 1892.37,
      "to": 1895.88,
      "location": 2,
      "content": "สถานที่ถูกปิดล้อมเรียบร้อย\nขอให้ส่งเครื่องบินมาด้วยครับ ทราบแล้วเปลี่ยน"
    },
    {
      "from": 1896.26,
      "to": 1899.266,
      "location": 2,
      "content": "ทางนี้คือซากุระจากกองทหารราบที่หนึ่ง\nขอให้ส่งหน่วยรักษาความปลอดภัยมาด้วย"
    },
    {
      "from": 1899.76,
      "to": 1902.433,
      "location": 2,
      "content": "ทางนี้นัมเบอร์วัน\nเราได้เตรียมเสร็จไว้เมื่อห้านาทีที่แล้ว"
    },
    {
      "from": 1902.433,
      "to": 1903.93,
      "location": 2,
      "content": "อาจารย์เป็นใครกันแน่..."
    },
    {
      "from": 1940.92,
      "to": 1942.63,
      "location": 2,
      "content": "ขอบคุณครับ อาจารย์"
    },
    {
      "from": 1947.26,
      "to": 1950.1,
      "location": 2,
      "content": "โค้ด 01 ส่งตัวเสร็จเรียบร้อย"
    },
    {
      "from": 1952.35,
      "to": 1955.43,
      "location": 2,
      "content": "ฝากด้วยนะ พวกเด็กที่ถูกเลือก"
    },
    {
      "from": 1957.1,
      "to": 1958.233,
      "location": 2,
      "content": "เกรย์มอน"
    },
    {
      "from": 1983.8,
      "to": 1984.866,
      "location": 2,
      "content": "เกรย์มอน!"
    },
    {
      "from": 1984.933,
      "to": 1986.01,
      "location": 2,
      "content": "ไทจิ!"
    },
    {
      "from": 2006.65,
      "to": 2008.03,
      "location": 2,
      "content": "ทุกคน..."
    },
    {
      "from": 2009.2,
      "to": 2010.633,
      "location": 2,
      "content": "นายก็ไม่รู้ว่าทำไมใช่ไหมล่ะ"
    },
    {
      "from": 2010.87,
      "to": 2012.066,
      "location": 2,
      "content": "พวกฉันก็เหมือนกันแหละ"
    },
    {
      "from": 2012.41,
      "to": 2014.1,
      "location": 2,
      "content": "จู่ ๆ ก็ถูกพาตัวมาเฉยเลย"
    },
    {
      "from": 2014.7,
      "to": 2016.3,
      "location": 2,
      "content": "พวกเราก็เพิ่งมาถึงเมื่อกี้เอง"
    },
    {
      "from": 2016.75,
      "to": 2017.933,
      "location": 2,
      "content": "พวกปาตามอนก็ด้วยเหรอ"
    },
    {
      "from": 2018.04,
      "to": 2019.71,
      "location": 2,
      "content": "พอรู้สึกตัว เราก็มาอยู่ที่แล้ว"
    },
    {
      "from": 2020.04,
      "to": 2022,
      "location": 2,
      "content": "พี่ ปลอดภัยหรือเปล่า"
    },
    {
      "from": 2022.54,
      "to": 2024.21,
      "location": 2,
      "content": "พวกเราก็จะช่วยด้วยนะ"
    },
    {
      "from": 2024.71,
      "to": 2026.9,
      "location": 2,
      "content": "ก่อนอื่น\nเราต้องหาทางทำอะไรสักอย่างกับเจ้านั่น"
    },
    {
      "from": 2027.21,
      "to": 2029.38,
      "location": 2,
      "content": "ดีละ ลุยกันเลย"
    },
    {
      "from": 2029.84,
      "to": 2033.18,
      "location": 2,
      "content": "รอเดี๋ยวสิ นี่ ๆ แล้วมีมี่ล่ะ?"
    },
    {
      "from": 2033.39,
      "to": 2034.89,
      "location": 2,
      "content": "โจก็ไม่อยู่นะ"
    },
    {
      "from": 2037.06,
      "to": 2038.02,
      "location": 2,
      "content": "โธ่!"
    },
    {
      "from": 2038.133,
      "to": 2040.4,
      "location": 2,
      "content": "ทำไมคุณไทจิถึงไม่รับสายเลยเนี่ย"
    },
    {
      "from": 2041.23,
      "to": 2043.933,
      "location": 2,
      "content": "คนเขาอุตส่าห์กลับมาจากอเมริกาเชียวนะ"
    },
    {
      "from": 2044.205,
      "to": 2046.205,
      "location": 2,
      "content": "(เกิดเหตุที่สนามบินฮาเนดะ)"
    },
    {
      "from": 2046.23,
      "to": 2047.57,
      "location": 2,
      "content": "ฮาเนดะ?"
    },
    {
      "from": 2054.58,
      "to": 2056.54,
      "location": 2,
      "content": "ตรงนี้โทรไม่ติดจริง ๆ ด้วย"
    },
    {
      "from": 2057.24,
      "to": 2060.41,
      "location": 2,
      "content": "มีมี่ อยู่ที่ไหนเนี่ย"
    },
    {
      "from": 2061.71,
      "to": 2062.58,
      "location": 2,
      "content": "เกรย์มอน"
    },
    {
      "from": 2069.63,
      "to": 2071.7,
      "location": 2,
      "content": "โกหกน่า มีสามตัวเลยเหรอ"
    },
    {
      "from": 2077.68,
      "to": 2078.39,
      "location": 2,
      "content": "อากูมอน"
    },
    {
      "from": 2078.39,
      "to": 2079.3,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 2079.43,
      "to": 2081.1,
      "location": 2,
      "content": "โธ่ว้อย! กาบูมอน"
    },
    {
      "from": 2081.44,
      "to": 2082.266,
      "location": 2,
      "content": "โอ้!"
    },
    {
      "from": 2094.78,
      "to": 2097.28,
      "location": 2,
      "content": "กาบูมอน เปลี่ยนร่าง"
    },
    {
      "from": 2118.01,
      "to": 2119.47,
      "location": 2,
      "content": "การูรูมอน"
    },
    {
      "from": 2122.48,
      "to": 2124.65,
      "location": 2,
      "content": "เป็นอะไรหรือเปล่า อากูมอน"
    },
    {
      "from": 2136.99,
      "to": 2138.62,
      "location": 2,
      "content": "แย่แล้ว พวกมันกระจายตัวไปทางอื่น"
    },
    {
      "from": 2138.83,
      "to": 2140.49,
      "location": 2,
      "content": "พวกเราก็แยกย้ายด้วยเถอะครับ"
    },
    {
      "from": 2142.33,
      "to": 2145.17,
      "location": 2,
      "content": "ให้ตายสิ เฉียดไปนิดเดียวเอง"
    },
    {
      "from": 2153.38,
      "to": 2155.47,
      "location": 2,
      "content": "แย่แล้ว มันกำลังจะหนี"
    },
    {
      "from": 2155.68,
      "to": 2156.4,
      "location": 2,
      "content": "ปิโยมอน"
    },
    {
      "from": 2156.533,
      "to": 2157.433,
      "location": 2,
      "content": "ไปกันเลย"
    },
    {
      "from": 2170.233,
      "to": 2172.56,
      "location": 2,
      "content": "ปิโยมอน เปลี่ยนร่าง"
    },
    {
      "from": 2193.88,
      "to": 2195.38,
      "location": 2,
      "content": "เบิร์ดรามอน"
    },
    {
      "from": 2200.39,
      "to": 2201.18,
      "location": 2,
      "content": "เจ๋งเลย"
    },
    {
      "from": 2201.333,
      "to": 2202.566,
      "location": 2,
      "content": "พวกเราก็มาลุยกันบ้างเถอะ"
    },
    {
      "from": 2202.72,
      "to": 2204.333,
      "location": 2,
      "content": "ถึงตาผมออกโรงแล้วสินะ"
    },
    {
      "from": 2216.74,
      "to": 2219.333,
      "location": 2,
      "content": "เท็นโตมอน เปลี่ยนร่าง"
    },
    {
      "from": 2240.43,
      "to": 2242.26,
      "location": 2,
      "content": "คาบุเทริมอน"
    },
    {
      "from": 2252.566,
      "to": 2253.61,
      "location": 2,
      "content": "อย่าหวังว่าจะรอด"
    },
    {
      "from": 2253.82,
      "to": 2254.9,
      "location": 2,
      "content": "เราต้องหยุดมันที่นี่ให้ได้"
    },
    {
      "from": 2255.07,
      "to": 2256.233,
      "location": 2,
      "content": "โอเค ทาเครุ"
    },
    {
      "from": 2256.44,
      "to": 2257.95,
      "location": 2,
      "content": "เชื่อมือได้เลย ฮิคาริ"
    },
    {
      "from": 2271.13,
      "to": 2273.5,
      "location": 2,
      "content": "ปาตามอน เปลี่ยนร่าง"
    },
    {
      "from": 2295.82,
      "to": 2297.15,
      "location": 2,
      "content": "แองเจมอน"
    },
    {
      "from": 2313,
      "to": 2317.4,
      "location": 2,
      "content": "มีมี่ รีบมาเร็วเข้าสิ\nฉันเปลี่ยนร่างคนเดียวไม่ได้นะ"
    },
    {
      "from": 2317.55,
      "to": 2319.8,
      "location": 2,
      "content": "เดี๋ยวฉันไปรับโจก่อนนะ"
    },
    {
      "from": 2320.033,
      "to": 2324.51,
      "location": 2,
      "content": "ตอนนี้ได้มีการเริ่มอพยพลูกเรือ\nและผู้โดยสารที่สนามบินฮาเนดะแล้วค่ะ"
    },
    {
      "from": 2324.85,
      "to": 2326.81,
      "location": 2,
      "content": "ใช่จริง ๆ ด้วยสินะ..."
    },
    {
      "from": 2329.02,
      "to": 2331.366,
      "location": 2,
      "content": "คุณ...ฉันมองไม่เห็นนะคะ"
    },
    {
      "from": 2331.52,
      "to": 2332.85,
      "location": 2,
      "content": "ข่าวฮาเนดะใช่ไหม"
    },
    {
      "from": 2333.73,
      "to": 2335.36,
      "location": 2,
      "content": "เธอไม่จำเป็นต้องดูหรอก"
    },
    {
      "from": 2336.02,
      "to": 2337.633,
      "location": 2,
      "content": "เพราะตอนนี้เธอกำลังจะไปที่นั่นไง"
    },
    {
      "from": 2337.73,
      "to": 2338.733,
      "location": 2,
      "content": "หา!"
    },
    {
      "from": 2339.4,
      "to": 2343.53,
      "location": 2,
      "content": "ยินดีต้อนรับกลับมานะ คุณทาชิคาวะ มีมี่"
    },
    {
      "from": 2381.78,
      "to": 2383.9,
      "location": 2,
      "content": "ว้าว สำเร็จแล้ว"
    },
    {
      "from": 2384.24,
      "to": 2386.24,
      "location": 2,
      "content": "นี่ ทุกคนอยู่ที่นั่นหมดเลยเหรอ"
    },
    {
      "from": 2386.45,
      "to": 2389.08,
      "location": 2,
      "content": "มีกี่คนล่ะ พวกพัลมอนก็อยู่ครบเลยเหรอ"
    },
    {
      "from": 2390.74,
      "to": 2393.25,
      "location": 2,
      "content": "เพราะฉันต้องแจกของฝากให้กับทุกคนนี่นา"
    },
    {
      "from": 2394.233,
      "to": 2395.2,
      "location": 2,
      "content": "มาได้จังหวะเลย"
    },
    {
      "from": 2395.7,
      "to": 2399.25,
      "location": 2,
      "content": "ฉันกำลังหนักใจอยู่พอดี\nว่าจะเอาให้พวกพัลมอนยังไงน่ะ"
    },
    {
      "from": 2419.11,
      "to": 2420.27,
      "location": 2,
      "content": "หายไปแล้ว"
    },
    {
      "from": 2420.48,
      "to": 2421.9,
      "location": 2,
      "content": "ที่เหลือก็มีแค่ตัวเดียว"
    },
    {
      "from": 2449.47,
      "to": 2450.8,
      "location": 2,
      "content": "ลุกขึ้นสิ การูรูมอน"
    },
    {
      "from": 2466.99,
      "to": 2468.61,
      "location": 2,
      "content": "เมื่อกี้มันอะไรกัน"
    },
    {
      "from": 2468.82,
      "to": 2469.9,
      "location": 2,
      "content": "ไม่รู้เลยครับ"
    },
    {
      "from": 2479.83,
      "to": 2481.533,
      "location": 2,
      "content": "เท่านี้ก็จบแล้วเหรอ"
    },
    {
      "from": 2482,
      "to": 2484,
      "location": 2,
      "content": "โล่งอกไปทีที่โค่นพวกมันได้"
    },
    {
      "from": 2484.21,
      "to": 2486.51,
      "location": 2,
      "content": "ใช่ครับ แต่ว่า..."
    },
    {
      "from": 2489.51,
      "to": 2491.85,
      "location": 2,
      "content": "เสียหายไปเยอะเหมือนกันนะครับ"
    },
    {
      "from": 2515.87,
      "to": 2517.87,
      "location": 2,
      "content": "คนพวกนั้นเป็นใครกันแน่"
    },
    {
      "from": 2518.133,
      "to": 2520.671,
      "location": 2,
      "content": "พวกคนที่พาเรามาที่นี่\nและพวกที่ตามมาจัดการทีหลังนี่"
    },
    {
      "from": 2520.695,
      "to": 2522.04,
      "location": 2,
      "content": "ชำนาญงานกันเกินไปแล้ว"
    },
    {
      "from": 2522.25,
      "to": 2524.5,
      "location": 2,
      "content": "พอถามก็ไม่ยอมตอบอะไรเลย"
    },
    {
      "from": 2525.7,
      "to": 2529.05,
      "location": 2,
      "content": "จู่ ๆ ก็มีหลายเรื่องเกิดขึ้นเยอะเกินไป\nจนฉันงงไปหมดแล้วเนี่ย"
    },
    {
      "from": 2529.72,
      "to": 2532.18,
      "location": 2,
      "content": "เราขาดแคลนข้อมูลอยู่เยอะเลยนะครับ"
    },
    {
      "from": 2532.39,
      "to": 2536.233,
      "location": 2,
      "content": "จะว่าไป คนที่พาฉันมาที่นี่\nก็คืออาจารย์นิชิจิมะเองแหละ"
    },
    {
      "from": 2536.72,
      "to": 2538.866,
      "location": 2,
      "content": "เอ๊ะ อาจารย์ที่โรงเรียนเราเหรอ"
    },
    {
      "from": 2538.89,
      "to": 2540.39,
      "location": 2,
      "content": "เขาเป็นผู้เกี่ยวข้องงั้นเหรอ"
    },
    {
      "from": 2541.27,
      "to": 2544.73,
      "location": 2,
      "content": "ถ้างั้นเราก็อาจจะมีโอกาส\nได้ข้อมูลจากเขาหลายเรื่องเลยก็ได้"
    },
    {
      "from": 2545.11,
      "to": 2546.23,
      "location": 2,
      "content": "ใช่..."
    },
    {
      "from": 2551.41,
      "to": 2553.266,
      "location": 2,
      "content": "พัลมอน!"
    },
    {
      "from": 2553.57,
      "to": 2555.08,
      "location": 2,
      "content": "ทุกคน!"
    },
    {
      "from": 2555.41,
      "to": 2556.58,
      "location": 2,
      "content": "มีมี่"
    },
    {
      "from": 2557.95,
      "to": 2560.54,
      "location": 2,
      "content": "ไม่ได้เจอกันนานเลยเนอะ ดีใจจัง"
    },
    {
      "from": 2560.75,
      "to": 2561.92,
      "location": 2,
      "content": "- คุณมีมี่\n- มีมี่จัง"
    },
    {
      "from": 2562.42,
      "to": 2563.92,
      "location": 2,
      "content": "ทุกคนก็ไม่ได้เจอกันนานเลยนะ"
    },
    {
      "from": 2564.25,
      "to": 2565.88,
      "location": 2,
      "content": "กลับมาแล้วเหรอครับ"
    },
    {
      "from": 2566.09,
      "to": 2568.55,
      "location": 2,
      "content": "หรือว่าเธอจะกลับมาเพราะการต่อสู้ครั้งนี้"
    },
    {
      "from": 2568.76,
      "to": 2571.09,
      "location": 2,
      "content": "โน ๆ ไม่ใช่แบบนั้น"
    },
    {
      "from": 2571.63,
      "to": 2574.6,
      "location": 2,
      "content": "เดิมทีก็ตั้งใจว่าจะกลับมาอยู่หรอก"
    },
    {
      "from": 2575.1,
      "to": 2577.93,
      "location": 2,
      "content": "แล้วก็ได้ยินว่าคุณไทจิมีแข่งพอดีเลย"
    },
    {
      "from": 2578.14,
      "to": 2580.06,
      "location": 2,
      "content": "จริงด้วยสิ นี่ไงล่ะ"
    },
    {
      "from": 2580.27,
      "to": 2583.94,
      "location": 2,
      "content": "ของฝากจ้ะ\nเป็นเยลลี่ที่ฉันติดงอมแงมอยู่ตอนนี้"
    },
    {
      "from": 2584.31,
      "to": 2587.9,
      "location": 2,
      "content": "ถึงสีจะดูมีพิษภัยแต่ก็กินติดปาก\nมีมี่ขอแนะนำเลยนะ"
    },
    {
      "from": 2588.11,
      "to": 2589.23,
      "location": 2,
      "content": "เชิญเลย อากูมอน"
    },
    {
      "from": 2589.44,
      "to": 2592.28,
      "location": 2,
      "content": "กินนี่แล้วจะต้องร่าเริงขึ้นแน่นอน"
    },
    {
      "from": 2595.45,
      "to": 2596.533,
      "location": 2,
      "content": "อร่อยจัง!"
    },
    {
      "from": 2596.62,
      "to": 2598.12,
      "location": 2,
      "content": "ดีจังเลย ดีจังเลย"
    },
    {
      "from": 2598.33,
      "to": 2599.75,
      "location": 2,
      "content": "ขอฉันบ้างสิ"
    },
    {
      "from": 2599.95,
      "to": 2602.58,
      "location": 2,
      "content": "กินกันเข้าไปเลยนะ มีอีกเพียบ"
    },
    {
      "from": 2602.79,
      "to": 2604.46,
      "location": 2,
      "content": "ฉันกินด้วย"
    },
    {
      "from": 2604.67,
      "to": 2606.59,
      "location": 2,
      "content": "ผมขอกินด้วยนะ"
    },
    {
      "from": 2608.433,
      "to": 2610.76,
      "location": 2,
      "content": "ส่วนของทุกคนก็มีเหมือนกัน เอากลับบ้านไปด้วยนะ"
    },
    {
      "from": 2610.96,
      "to": 2612.13,
      "location": 2,
      "content": "ขอบคุณมากครับ"
    },
    {
      "from": 2612.3,
      "to": 2614.966,
      "location": 2,
      "content": "ว่าแต่ เราจะกลับบ้านกันยังไงดีครับ"
    },
    {
      "from": 2616.1,
      "to": 2618.85,
      "location": 2,
      "content": "ลองไปขอร้องคนที่พาฉันมาส่งดูสิ"
    },
    {
      "from": 2624.98,
      "to": 2627.4,
      "location": 2,
      "content": "ยัยนั่นเป็นใครกันแน่เนี่ย"
    },
    {
      "from": 2627.61,
      "to": 2629.266,
      "location": 2,
      "content": "รู้สึกน่ากลัวนิดหน่อยจัง"
    },
    {
      "from": 2629.44,
      "to": 2632.2,
      "location": 2,
      "content": "แต่ก็ค่อยยังชั่วหน่อยนะ\nที่พวกเรากลับกันได้อย่างปลอดภัย"
    },
    {
      "from": 2632.566,
      "to": 2635.11,
      "location": 2,
      "content": "อ้าว แล้วรุ่นพี่โจกับโกมามอนล่ะ"
    },
    {
      "from": 2635.266,
      "to": 2637.41,
      "location": 2,
      "content": "เรื่องนั้นเราก็ไม่รู้เหมือนกันครับ"
    },
    {
      "from": 2637.62,
      "to": 2640.33,
      "location": 2,
      "content": "เหมือนจะมีเหตุผลอะไรสักอย่าง\nที่มาไม่ได้แหละมั้ง"
    },
    {
      "from": 2640.33,
      "to": 2640.333,
      "location": 2,
      "content": "เหมือนจะมีเหตุผลอะไรสักอย่าง\nที่มาไม่ได้แหละมั้ง\nนั่นสิเนอะ เขาเป็นนักเรียนเตรียมสอบด้วย"
    },
    {
      "from": 2640.333,
      "to": 2642.62,
      "location": 2,
      "content": "นั่นสิเนอะ เขาเป็นนักเรียนเตรียมสอบด้วย"
    },
    {
      "from": 2643,
      "to": 2645,
      "location": 2,
      "content": "นักเรียนเตรียมสอบงั้นเหรอ..."
    },
    {
      "from": 2648.54,
      "to": 2650.4,
      "location": 2,
      "content": "เป็นอะไรไปเหรอ โคชิโร่คุง"
    },
    {
      "from": 2650.5,
      "to": 2652.51,
      "location": 2,
      "content": "เปล่าครับ ไม่มีอะไร"
    },
    {
      "from": 2653.1,
      "to": 2656.866,
      "location": 2,
      "content": "เผอิญว่าฉันน่ารักขึ้น\nจนนายหัวใจเต้นรัวเลยใช่ไหม"
    },
    {
      "from": 2657.133,
      "to": 2659.18,
      "location": 2,
      "content": "มะ.. ไม่ใช่แบบนั้นเลยครับ"
    },
    {
      "from": 2660.06,
      "to": 2661.56,
      "location": 2,
      "content": "ฉันล้อเล่นหรอกน่า"
    },
    {
      "from": 2662.68,
      "to": 2665.85,
      "location": 2,
      "content": "คุณกลับมาเพื่อที่จะ\nดูคุณไทจิแข่งฟุตบอลสินะครับ"
    },
    {
      "from": 2666.06,
      "to": 2669.06,
      "location": 2,
      "content": "อ๊ะ จริงด้วยสิ ขอค่าเครื่องบินหน่อยนะ"
    },
    {
      "from": 2669.9,
      "to": 2671.36,
      "location": 2,
      "content": "ว่าไปนั่นแหละ"
    },
    {
      "from": 2671.57,
      "to": 2676.6,
      "location": 2,
      "content": "อันที่จริงฉันจะกลับมาอยู่ที่ญี่ปุ่นสักพัก\nเพราะเรื่องงานของป๊ะป๋าน่ะ"
    },
    {
      "from": 2676.74,
      "to": 2678.833,
      "location": 2,
      "content": "ทุกคน ขอฝากเนื้อฝากตัวอีกครั้งนะ"
    },
    {
      "from": 2693.233,
      "to": 2694.59,
      "location": 2,
      "content": "(สิ่งมีชีวิตที่ไม่สามารถระบุได้)\n(ปรากฏตัวขึ้นที่ฮาเนดะ)"
    },
    {
      "from": 2708.9,
      "to": 2710.11,
      "location": 2,
      "content": "โกมามอน"
    },
    {
      "from": 2713.11,
      "to": 2714.4,
      "location": 2,
      "content": "ฉันมาแล้วนะ"
    },
    {
      "from": 2724.33,
      "to": 2727.333,
      "location": 2,
      "content": "สิ่งมีชีวิตซึ่งไม่สามารถระบุได้\nที่ปรากฏตัวขึ้นเมื่อวานนี้"
    },
    {
      "from": 2727.433,
      "to": 2728.705,
      "location": 2,
      "content": "สร้างความเสียหายอย่างหนัก"
    },
    {
      "from": 2728.729,
      "to": 2731.08,
      "location": 2,
      "content": "ให้กับบริเวณโดยรอบของโอไดบะ\nและสนามบินฮาเนดะค่ะ"
    },
    {
      "from": 2731.29,
      "to": 2732.308,
      "location": 2,
      "content": "ถึงแม้จะน่าเหลือเชื่อ"
    },
    {
      "from": 2732.332,
      "to": 2734.38,
      "location": 2,
      "content": "ที่ยังไม่มีการยืนยันว่า\nมีผู้ได้รับบาดเจ็บสาหัสก็ตาม"
    },
    {
      "from": 2734.59,
      "to": 2736.764,
      "location": 2,
      "content": "แต่ผลกระทบที่ส่งต่อระบบคมนาคมโดยเฉพาะ"
    },
    {
      "from": 2736.788,
      "to": 2739.966,
      "location": 2,
      "content": "การยกเลิกเที่ยวบินทั้งหมด\nของสนามบินฮาเนดะนั้นมหาศาลมาก"
    },
    {
      "from": 2739.97,
      "to": 2742.26,
      "location": 2,
      "content": "จึงจำเป็นต้องมีมาตราการรับมืออย่างเร่งด่วนค่ะ"
    },
    {
      "from": 2743.31,
      "to": 2746.27,
      "location": 2,
      "content": "สิ่งมีชีวิตนี้\nเคยปรากฏตัวขึ้นหลายครั้งในอดีตด้วย"
    },
    {
      "from": 2746.48,
      "to": 2749.27,
      "location": 2,
      "content": "โดยได้สร้างความเสียหายในแต่ละครั้งเช่นกันค่ะ"
    },
    {
      "from": 2750.19,
      "to": 2753.185,
      "location": 2,
      "content": "เนื่องจากครั้งนี้พวกมัน\nปรากฏพร้อมกันหลายตัวในครั้งเดียว"
    },
    {
      "from": 2753.209,
      "to": 2755.11,
      "location": 2,
      "content": "จึงทำให้เกิดความเสียหายหนักยิ่งขึ้น"
    },
    {
      "from": 2755.32,
      "to": 2759.11,
      "location": 2,
      "content": "จนกลายเป็นสิ่งที่คอยย้ำเตือนเราอีกครั้ง\nถึงภัยคุกคามและพลังทำลายล้างของมันค่ะ"
    },
    {
      "from": 2759.32,
      "to": 2761.1,
      "location": 2,
      "content": "ส่วนนี่ก็คือปฏิกริยาของผู้คนในเมืองค่ะ"
    },
    {
      "from": 2761.82,
      "to": 2764.566,
      "location": 2,
      "content": "แค่คิดว่ามันอาจจะโผล่มาอีก ฉันก็กังวลแล้ว"
    },
    {
      "from": 2768.33,
      "to": 2772.83,
      "location": 2,
      "content": "ถ้าเป็นแบบนี้ พวกอากูมอนก็คงถูกปฏิบัติ\nเหมือนกับคุวากามอนไปด้วยสินะ"
    },
    {
      "from": 2775,
      "to": 2778.3,
      "location": 2,
      "content": "ทั้งที่พวกเราอุตส่าห์สู้กับคุวากามอนเลยนะ"
    },
    {
      "from": 2778.51,
      "to": 2782.433,
      "location": 2,
      "content": "ลูกฉันกลัวจนไม่อยากออกมาข้างนอกอีกเลย"
    },
    {
      "from": 2783.51,
      "to": 2786.2,
      "location": 2,
      "content": "รัฐบาลได้กำหนด\nจัดการประชุมวิสามัญตั้งแต่เช้าวันนี้"
    },
    {
      "from": 2786.22,
      "to": 2790.98,
      "location": 2,
      "content": "โดยประสานงานกับตำรวจและกองกำลังป้องกันตนเอง\nเพื่อหารือเกี่ยวกับแผนรับมือสำหรับอนาคตค่ะ"
    },
    {
      "from": 2791.19,
      "to": 2796.433,
      "location": 2,
      "content": "ตายจริง อากูจังกับเทลจัง\nไม่ได้ทำเรื่องน่ากลัวสักหน่อยนะ"
    },
    {
      "from": 2796.666,
      "to": 2797.44,
      "location": 2,
      "content": "- ใช่แล้ว\n- ใช่แล้ว"
    },
    {
      "from": 2797.65,
      "to": 2800.066,
      "location": 2,
      "content": "ทุกคนนี่ไม่รู้เรื่องเอาซะเลยเนอะ"
    },
    {
      "from": 2800.2,
      "to": 2800.78,
      "location": 2,
      "content": "- ใช่แล้ว\n- ใช่แล้ว"
    },
    {
      "from": 2801.1,
      "to": 2802.63,
      "location": 2,
      "content": "ต่อไปเป็นรายงานสภาพอากาศค่ะ"
    },
    {
      "from": 2803.03,
      "to": 2806.033,
      "location": 2,
      "content": "ใกล้จะสิ้นสุดฤดูฝนในไม่ช้านี้แล้วค่ะ"
    },
    {
      "from": 2811.54,
      "to": 2812.87,
      "location": 2,
      "content": "ยามาโตะ"
    },
    {
      "from": 2813.83,
      "to": 2816.04,
      "location": 2,
      "content": "เห็นข่าวหรือยัง"
    },
    {
      "from": 2821.38,
      "to": 2824.166,
      "location": 2,
      "content": "ได้ยินว่าพ่อของทานากะคุงอยู่ที่ฮาเนดะด้วยนะ"
    },
    {
      "from": 2824.39,
      "to": 2825.766,
      "location": 2,
      "content": "โกหกน่า เรื่องจริงเหรอ"
    },
    {
      "from": 2825.85,
      "to": 2827.9,
      "location": 2,
      "content": "เห็นว่าได้รับบาดเจ็บจนเข้าโรงพยาบาลเลย"
    },
    {
      "from": 2828.033,
      "to": 2829.666,
      "location": 2,
      "content": "ไทจิ ไปกันเถอะ"
    },
    {
      "from": 2839.19,
      "to": 2841.533,
      "location": 2,
      "content": "อาจารย์นิชิจิมะไม่อยู่น่ะ"
    },
    {
      "from": 2841.57,
      "to": 2843.9,
      "location": 2,
      "content": "ทั้ง ๆ ที่มีเรื่องอยากถามอยู่เยอะเลยแท้ ๆ"
    },
    {
      "from": 2844,
      "to": 2845.7,
      "location": 2,
      "content": "- ขอตัวก่อนนะคะ\n- ขอตัวก่อนนะคะ"
    },
    {
      "from": 2846.74,
      "to": 2847.6,
      "location": 2,
      "content": "คุณมีมี่?"
    },
    {
      "from": 2847.933,
      "to": 2849.37,
      "location": 2,
      "content": "ทำไมถึงมาอยู่ที่นี่ได้ล่ะ"
    },
    {
      "from": 2849.58,
      "to": 2852.16,
      "location": 2,
      "content": "เอ๊ะ ฉันยังไม่ได้บอกอีกเหรอ"
    },
    {
      "from": 2852.37,
      "to": 2855.67,
      "location": 2,
      "content": "ตั้งแต่วันนี้ไป\nฉันจะมาเป็นเรียนชั้นปี  1 ของที่นี่"
    },
    {
      "from": 2855.88,
      "to": 2858.42,
      "location": 2,
      "content": "อยู่ห้องเดียวกับโคชิโร่คุงด้วยนะ"
    },
    {
      "from": 2866.05,
      "to": 2867.366,
      "location": 2,
      "content": "เพื่อนเหรอ?"
    },
    {
      "from": 2867.39,
      "to": 2870.366,
      "location": 2,
      "content": "เปล่าหรอก\nเหมือนเธอจะเป็นนักเรียนย้ายมาใหม่ด้วยน่ะ"
    },
    {
      "from": 2870.43,
      "to": 2872.93,
      "location": 2,
      "content": "เธออยู่ชั้นปี 2\nอาจจะเรียนห้องเดียวกับคุณโซระก็ได้"
    },
    {
      "from": 2873.27,
      "to": 2874.94,
      "location": 2,
      "content": "เอ๊ะ จริงเหรอ"
    },
    {
      "from": 2877,
      "to": 2880.4,
      "location": 2,
      "content": "โคชิโร่คุง พาฉันไปห้องเรียนหน่อยได้ไหม"
    },
    {
      "from": 2880.44,
      "to": 2882.966,
      "location": 2,
      "content": "อ๋อครับ ได้อยู่แล้ว"
    },
    {
      "from": 2883.11,
      "to": 2884.24,
      "location": 2,
      "content": "ไว้เจอกันนะ มีมี่จัง"
    },
    {
      "from": 2884.45,
      "to": 2885.566,
      "location": 2,
      "content": "แล้วเจอกัน"
    },
    {
      "from": 2887.933,
      "to": 2889.566,
      "location": 2,
      "content": "แต่เสียดายจังเลยนะ"
    },
    {
      "from": 2890.066,
      "to": 2892.63,
      "location": 2,
      "content": "การแข่งของไทจิและคอนเสิร์ตของยามาโตะ\nถูกเลื่อนวันหมดเลยใช่ไหม"
    },
    {
      "from": 2892.866,
      "to": 2894.9,
      "location": 2,
      "content": "จนกว่าสถานการณ์จะปกติมั้งนะ"
    },
    {
      "from": 2894.96,
      "to": 2896.79,
      "location": 2,
      "content": "น่าจะแบบนั้นแหละ"
    },
    {
      "from": 2898.5,
      "to": 2899.6,
      "location": 2,
      "content": "(เมย์โกะ)"
    },
    {
      "from": 2900.92,
      "to": 2903.566,
      "location": 2,
      "content": "ฉะ.. ฉันชื่อโมจิซึกิ เมย์โกะค่ะ\nโมจิซึกิ เมย์โกะ"
    },
    {
      "from": 2904.97,
      "to": 2910.3,
      "location": 2,
      "content": "ฉันย้ายมาจากทตโตริค่ะ\nขะ.. ขอฝากเนื้อฝากตัวด้วยนะคะ"
    },
    {
      "from": 2922.666,
      "to": 2924.53,
      "location": 2,
      "content": "ถ้างั้นครูจะเริ่มสอนแล้วนะ"
    },
    {
      "from": 2925.82,
      "to": 2927.2,
      "location": 2,
      "content": "สรุปแล้ว..."
    },
    {
      "from": 2927.28,
      "to": 2930.933,
      "location": 2,
      "content": "ไอ้สิ่งมีชีวิตที่ระบุไม่ได้นี่\nมันคือตัวอะไรกันแน่เนี่ย"
    },
    {
      "from": 2930.95,
      "to": 2934.766,
      "location": 2,
      "content": "ไม่รู้สิ มีสัตว์ประหลาดโผล่มาสองตัว\nแล้วก็อาละวาดเลยนี่นา"
    },
    {
      "from": 2934.866,
      "to": 2936.79,
      "location": 2,
      "content": "น่ารำคาญเป็นบ้า"
    },
    {
      "from": 2937,
      "to": 2939.33,
      "location": 2,
      "content": "อยากให้พวกมันรีบตายไปให้หมดจังแฮะ"
    },
    {
      "from": 2939.67,
      "to": 2940.7,
      "location": 2,
      "content": "ไม่เอาน่า"
    },
    {
      "from": 2940.84,
      "to": 2942.033,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 2943.84,
      "to": 2946.17,
      "location": 2,
      "content": "โทษที ไม่มีอะไรหรอก"
    },
    {
      "from": 2948.51,
      "to": 2951.5,
      "location": 2,
      "content": "ถึงเราจะโมโหไป มันก็ช่วยอะไรไม่ได้อยู่ดี"
    },
    {
      "from": 2951.51,
      "to": 2952.76,
      "location": 2,
      "content": "ว่าไงนะ"
    },
    {
      "from": 2952.97,
      "to": 2954.35,
      "location": 2,
      "content": "มีอะไรกันน่ะ"
    },
    {
      "from": 2958.83,
      "to": 2960.933,
      "location": 2,
      "content": "เปล่า ไม่มีอะไร"
    },
    {
      "from": 2961.15,
      "to": 2962.8,
      "location": 2,
      "content": "เรื่องข่าวเมื่อตอนเช้าเหรอ"
    },
    {
      "from": 2963.19,
      "to": 2964.36,
      "location": 2,
      "content": "ใช่สินะ"
    },
    {
      "from": 2967.32,
      "to": 2969.66,
      "location": 2,
      "content": "เดี๋ยวไปรวมตัวกับทุกคนกันไหม"
    },
    {
      "from": 2981.54,
      "to": 2983.34,
      "location": 2,
      "content": "อ๊ะ มาแล้ว"
    },
    {
      "from": 2983.55,
      "to": 2984.733,
      "location": 2,
      "content": "รุ่นพี่โจ"
    },
    {
      "from": 2985.033,
      "to": 2986.88,
      "location": 2,
      "content": "ขอโทษที่มาช้านะ"
    },
    {
      "from": 2987.22,
      "to": 2989.01,
      "location": 2,
      "content": "ไม่ได้เจอกันนานเลย"
    },
    {
      "from": 2989.72,
      "to": 2993.68,
      "location": 2,
      "content": "อันนี้เป็นของฝากนะ\nโล่งอกไปที ดีใจจังที่ได้เจอกัน"
    },
    {
      "from": 2993.89,
      "to": 2996.333,
      "location": 2,
      "content": "มีมี่คุงนี่ไม่เปลี่ยนไปเลยนะ"
    },
    {
      "from": 2996.53,
      "to": 3000.1,
      "location": 2,
      "content": "ขอโทษที่ให้ช่วยมา\nทั้งที่ติวหนังสือเตรียมสอบอยู่นะคะ"
    },
    {
      "from": 3000.4,
      "to": 3001.8,
      "location": 2,
      "content": "ไม่เป็นไรหรอก"
    },
    {
      "from": 3002.06,
      "to": 3004.2,
      "location": 2,
      "content": "ผมเองก็มีเรื่องที่อยากพูดเหมือนกัน"
    },
    {
      "from": 3006.4,
      "to": 3009.2,
      "location": 2,
      "content": "ก่อนอื่น\nเราลองมาเรียบเรียงสถานการณ์นะครับ"
    },
    {
      "from": 3009.36,
      "to": 3012.7,
      "location": 2,
      "content": "ผมสรุปเหตุการณ์  6 อย่าง\nที่เกิดขึ้นในช่วงนี้มาแล้วครับ"
    },
    {
      "from": 3012.91,
      "to": 3013.7,
      "location": 2,
      "content": "อย่างแรก..."
    },
    {
      "from": 3013.91,
      "to": 3016.678,
      "location": 2,
      "content": "เมื่อไม่นานมานี้\nประตูที่เชื่อมสู่ดิจิตอลเวิลด์"
    },
    {
      "from": 3016.702,
      "to": 3019.833,
      "location": 2,
      "content": "ไม่สามารถใช้งานได้\nในหนึ่งปีที่ผ่านมาเป็นอย่างต่ำครับ"
    },
    {
      "from": 3020.08,
      "to": 3023.71,
      "location": 2,
      "content": "และด้วยสาเหตุอะไรบางอย่าง\nดิจิไวซ์จึงทำงานผิดปกติ"
    },
    {
      "from": 3023.92,
      "to": 3025.38,
      "location": 2,
      "content": "อันนั้นคือเรื่องที่สองครับ"
    },
    {
      "from": 3025.59,
      "to": 3026.55,
      "location": 2,
      "content": "เรื่องที่สาม"
    },
    {
      "from": 3026.76,
      "to": 3030.05,
      "location": 2,
      "content": "พื้นที่ที่เกิดสัญญาณรบกวนทางคลื่นไฟฟ้า\nส่วนใหญ่มักจะเป็นที่โอไดบะ"
    },
    {
      "from": 3030.26,
      "to": 3033.4,
      "location": 2,
      "content": "ซึ่งหลังจากนั้นก็เกิดไฟดับ\nโดยไม่ทราบสาเหตุขึ้นมาทันทีครับ"
    },
    {
      "from": 3033.93,
      "to": 3034.72,
      "location": 2,
      "content": "เรื่องที่สี่"
    },
    {
      "from": 3034.86,
      "to": 3036.733,
      "location": 2,
      "content": "เนื่องจากผลกระทบของสัญญาณรบกวนทางคลื่นไฟฟ้า"
    },
    {
      "from": 3036.866,
      "to": 3040.16,
      "location": 2,
      "content": "จึงเกิดปัญหาใหญ่ต่อระบบเน็ตเวิร์ก\nโดยยกเว้นเครือข่ายแบบมีสาย"
    },
    {
      "from": 3040.166,
      "to": 3042.398,
      "location": 2,
      "content": "เลยทำให้การรับคลื่นสัญญาณของพวกมือถือ"
    },
    {
      "from": 3042.422,
      "to": 3045.26,
      "location": 2,
      "content": "โทรศัพท์ไร้สาย\nหรือการแพร่ภาพทางทีวีขัดข้องครับ"
    },
    {
      "from": 3045.27,
      "to": 3045.9,
      "location": 2,
      "content": "ใช่"
    },
    {
      "from": 3046.19,
      "to": 3047,
      "location": 2,
      "content": "เรื่องที่ห้า"
    },
    {
      "from": 3047.11,
      "to": 3049.833,
      "location": 2,
      "content": "เมื่อเกิดการบิดเบือนของมิติโดยไม่รู้สาเหตุ"
    },
    {
      "from": 3049.96,
      "to": 3052.438,
      "location": 2,
      "content": "สิ่งนั้นจึงทำให้\nมีการเชื่อมต่อกับดิจิตอลเวิลด์"
    },
    {
      "from": 3052.462,
      "to": 3053.966,
      "location": 2,
      "content": "ในรูปแบบที่ต่างจากดิจิตอลเกท"
    },
    {
      "from": 3054.1,
      "to": 3056.6,
      "location": 2,
      "content": "จนดิจิมอนจากที่นั่นปรากฏตัวออกมา\nยังโลกทางนี้ได้"
    },
    {
      "from": 3056.62,
      "to": 3058.12,
      "location": 2,
      "content": "เหมือนคุวากามอนที่โผล่มาเมื่อวานสินะ"
    },
    {
      "from": 3058.45,
      "to": 3059.2,
      "location": 2,
      "content": "เรื่องที่หก"
    },
    {
      "from": 3059.41,
      "to": 3064.066,
      "location": 2,
      "content": "ดิจิมอนที่โผล่มาจากมิติบิดเบือนนั้น\nมันไม่เหมือนกับตัวที่พวกเราเคยเห็นมาก่อน"
    },
    {
      "from": 3064.25,
      "to": 3066.63,
      "location": 2,
      "content": "และได้กลายพันธุ์แบบไม่รู้สาเหตุครับ"
    },
    {
      "from": 3066.96,
      "to": 3069.164,
      "location": 2,
      "content": "สันนิษฐานได้เลยว่าเหตุการณ์ทั้งหมดนี้"
    },
    {
      "from": 3069.188,
      "to": 3071.93,
      "location": 2,
      "content": "น่าจะเกิดจากผลกระทบของมิติบิดเบือนทั้งหมดครับ"
    },
    {
      "from": 3072.13,
      "to": 3073.64,
      "location": 2,
      "content": "มิติบิดเบือน..."
    },
    {
      "from": 3074.14,
      "to": 3078.1,
      "location": 2,
      "content": "สำหรับสาเหตุของเรื่องที่หนึ่งและสอง\nถึงผมจะยังไม่รู้ช่วงเวลาที่เกิดเหตุก็จริง"
    },
    {
      "from": 3078.31,
      "to": 3081.27,
      "location": 2,
      "content": "แต่ตอนนี้ผมมั่นใจได้เลย\nว่ามันต้องเกิดจากสาเหตุเดียวกันแน่นอน"
    },
    {
      "from": 3081.48,
      "to": 3083.455,
      "location": 2,
      "content": "ส่วนการที่สัญญาณรบกวนคลื่นไฟฟ้า\nของเรื่องที่สาม"
    },
    {
      "from": 3083.479,
      "to": 3085.066,
      "location": 2,
      "content": "มีสาเหตุจากมิติที่เกือบจะบิดเบือนนั้น"
    },
    {
      "from": 3085.066,
      "to": 3087.36,
      "location": 2,
      "content": "เห็นได้ชัดจากการตรวจสอบครั้งนี้เลยครับ"
    },
    {
      "from": 3087.82,
      "to": 3093.11,
      "location": 2,
      "content": "เนื่องด้วยสาเหตุของมิติบิดเบือนได้เกิดขึ้น\nตอนที่ดิจิตอลเวิลด์เชื่อมต่อกับโลกของเรา"
    },
    {
      "from": 3093.32,
      "to": 3095.5,
      "location": 2,
      "content": "ประมาณว่ามีการแทรกแซงเชิงบังคับ\nโดยเฉพาะจากฝั่งดิจิตอลเวิลด์..."
    },
    {
      "from": 3095.5,
      "to": 3097.9,
      "location": 2,
      "content": "- เข้ามาสู่เครือขายเน็ตเวิร์กของทางนี้ครับ\n- พี่ไปคุยกับอาจารย์มาแล้วเหรอ"
    },
    {
      "from": 3098.166,
      "to": 3100.833,
      "location": 2,
      "content": "- ด้วยผลกระทบนั้น...\n- ยังเลย อาจารย์นิชิจิมะไม่อยู่น่ะ"
    },
    {
      "from": 3100.9,
      "to": 3102.331,
      "location": 2,
      "content": "จึงทำให้มีการรบกวนคลื่นไฟฟ้าและเกิดไฟดับครับ"
    },
    {
      "from": 3102.355,
      "to": 3103.36,
      "location": 2,
      "content": "ทุกคน ได้ดูข่าวกันหรือเปล่า"
    },
    {
      "from": 3103.36,
      "to": 3104.424,
      "location": 2,
      "content": "ถึงจะยังพูดไม่ได้เต็มปาก"
    },
    {
      "from": 3104.448,
      "to": 3106.76,
      "location": 2,
      "content": "แต่เป็นไปได้ว่าดิจิมอน\nเป็นสาเหตุของการเกิดไฟดับครับ"
    },
    {
      "from": 3106.76,
      "to": 3106.766,
      "location": 2,
      "content": "แต่เป็นไปได้ว่าดิจิมอน\nเป็นสาเหตุของการเกิดไฟดับครับ\nโหดร้ายมากเลยนะ ที่รายงานข่าวแบบนั้น"
    },
    {
      "from": 3106.766,
      "to": 3109.033,
      "location": 2,
      "content": "โหดร้ายมากเลยนะ ที่รายงานข่าวแบบนั้น"
    },
    {
      "from": 3109.166,
      "to": 3110.96,
      "location": 2,
      "content": "พวกปาตามอนเองก็น่าสงสารด้วย"
    },
    {
      "from": 3111.166,
      "to": 3114.76,
      "location": 2,
      "content": "ฉันตั้งใจจะไปบอกให้พ่อพูดประท้วงพวกสื่อมวลชน"
    },
    {
      "from": 3114.84,
      "to": 3119.866,
      "location": 2,
      "content": "พวกสื่อก็แค่เสนอข่าวแบบกระตุ้นอารมณ์\nเพื่อดึงดูดความสนใจจากสังคมเท่านั้นแหละ"
    },
    {
      "from": 3120.01,
      "to": 3122.85,
      "location": 2,
      "content": "แต่ว่ามันก็มีส่วนที่เป็นความจริงเหมือนกัน"
    },
    {
      "from": 3123.69,
      "to": 3129.633,
      "location": 2,
      "content": "จริงอยู่ที่สนามบินและเมืองโอไดบะพังเสียหาย\nเพราะคุวากามอนโผล่ออกมา"
    },
    {
      "from": 3131.53,
      "to": 3134.28,
      "location": 2,
      "content": "แม้แต่ตัวฉันเอง พอเห็นแบบนั้นแล้ว..."
    },
    {
      "from": 3134.7,
      "to": 3138.73,
      "location": 2,
      "content": "ถ้าพวกอากูมอนไม่สู้\nมันก็จะยิ่งเลวร้ายไปมากกว่านี้อีกนะ"
    },
    {
      "from": 3138.87,
      "to": 3140.37,
      "location": 2,
      "content": "ใช่แล้ว"
    },
    {
      "from": 3141.04,
      "to": 3144.533,
      "location": 2,
      "content": "มันไม่ใช่เรื่องที่เราจะต้อง\nไปตำหนิพวกกาบูมอนเลยนะ"
    },
    {
      "from": 3144.56,
      "to": 3146.066,
      "location": 2,
      "content": "ฉันยอมรับไม่ได้หรอก"
    },
    {
      "from": 3148.04,
      "to": 3151.6,
      "location": 2,
      "content": "เป็นอะไรของนาย\nไทจิ อยากจะพูดอะไรกันแน่"
    },
    {
      "from": 3153.88,
      "to": 3156.01,
      "location": 2,
      "content": "นี่ไม่ใช่เรื่องที่จะต้องมาลังเลสักหน่อย"
    },
    {
      "from": 3156.22,
      "to": 3160.39,
      "location": 2,
      "content": "เหมือนอย่างที่โคชิโร่พูดนั่นแหละ\nปัญหาใหญ่กำลังจะเกิดขึ้นต่อหน้าเราแล้ว"
    },
    {
      "from": 3160.72,
      "to": 3163.39,
      "location": 2,
      "content": "เป็นเรื่องที่มีแต่พวกเราเท่านั้นที่ทำได้"
    },
    {
      "from": 3163.73,
      "to": 3164.533,
      "location": 2,
      "content": "แต่ว่า..."
    },
    {
      "from": 3164.666,
      "to": 3165.93,
      "location": 2,
      "content": "\"แต่ว่า\" อะไรของนายอีก!"
    },
    {
      "from": 3166.23,
      "to": 3168.02,
      "location": 2,
      "content": "ไทจิ ลืมไปแล้วเหรอ"
    },
    {
      "from": 3168.23,
      "to": 3170.079,
      "location": 2,
      "content": "ทั้งเรื่องที่เกิดขึ้นในดิจิตอลเวิลด์"
    },
    {
      "from": 3170.103,
      "to": 3172.933,
      "location": 2,
      "content": "รวมถึงเรื่องที่เราร่วมต่อสู้\nกับพวกกาบูมอนเพื่อปกป้องโลก"
    },
    {
      "from": 3172.966,
      "to": 3174.1,
      "location": 2,
      "content": "ฉันจะไปลืมได้ยังไงกันล่ะ"
    },
    {
      "from": 3178.74,
      "to": 3180.07,
      "location": 2,
      "content": "แล้วทำไมกัน..."
    },
    {
      "from": 3183.24,
      "to": 3184.466,
      "location": 2,
      "content": "ไทจิ!"
    },
    {
      "from": 3184.666,
      "to": 3186.666,
      "location": 2,
      "content": "ยามาโตะ ใจเย็นหน่อยสิ"
    },
    {
      "from": 3188.08,
      "to": 3189.21,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 3190.25,
      "to": 3192,
      "location": 2,
      "content": "นายไม่ใช่คนแบบนั้นสักหน่อย"
    },
    {
      "from": 3192.566,
      "to": 3194,
      "location": 2,
      "content": "ฉันเข้าใจแล้ว ช่างมันเถอะ"
    },
    {
      "from": 3195.09,
      "to": 3197.966,
      "location": 2,
      "content": "ดูเหมือนจะไม่มีประโยชน์\nที่เรามารวมตัวกันเพื่อหารือเลยนะ"
    },
    {
      "from": 3199.43,
      "to": 3201.4,
      "location": 2,
      "content": "เดี๋ยวสิ ยามาโตะ"
    },
    {
      "from": 3205.89,
      "to": 3207.233,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 3207.73,
      "to": 3210.44,
      "location": 2,
      "content": "โทษที ฉันเองก็กลับเลยแล้วกัน"
    },
    {
      "from": 3210.999,
      "to": 3212.999,
      "location": 2,
      "content": "ผมว่ามันถ้าเป็นแบบนี้ก็เข้าใจได้"
    },
    {
      "from": 3213.61,
      "to": 3217.466,
      "location": 2,
      "content": "- แต่ไม่รู้ว่าเป็นกระป๋องจากโรงงานผลิตไหน\n- ไม่เป็นไรหรอก เดี๋ยวผมไปคุยกับพี่ทีหลังเอง"
    },
    {
      "from": 3217.61,
      "to": 3219.266,
      "location": 2,
      "content": "อืม หนูก็ด้วย"
    },
    {
      "from": 3219.45,
      "to": 3221.833,
      "location": 2,
      "content": "ถ้างั้นพวกเราก็แยกย้ายกันเลยไหม"
    },
    {
      "from": 3221.95,
      "to": 3223.966,
      "location": 2,
      "content": "รู้สึกหิวขึ้นมาเฉยเลย"
    },
    {
      "from": 3224.333,
      "to": 3226.26,
      "location": 2,
      "content": "มีใครสนใจไปแวะกินกับฉันไหม"
    },
    {
      "from": 3226.29,
      "to": 3228.2,
      "location": 2,
      "content": "ผมมีเรียนต่อน่ะ"
    },
    {
      "from": 3228.46,
      "to": 3230.75,
      "location": 2,
      "content": "นาน ๆ ทีเราก็ต้องผ่อนคลายบ้างนะ"
    },
    {
      "from": 3230.96,
      "to": 3235.066,
      "location": 2,
      "content": "ทำแบบนั้นไม่ได้หรอก\nขนาดแฟนตัวเองก็ยังหาเวลาไปเจอไม่ได้เลย"
    },
    {
      "from": 3235.266,
      "to": 3236.09,
      "location": 2,
      "content": "แฟนเหรอ!"
    },
    {
      "from": 3236.3,
      "to": 3238.59,
      "location": 2,
      "content": "รุ่นพี่โจมีแฟนแล้วเหรอครับ"
    },
    {
      "from": 3238.8,
      "to": 3240.76,
      "location": 2,
      "content": "ไม่มีทาง เป็นไปไม่ได้เลย"
    },
    {
      "from": 3240.97,
      "to": 3242.72,
      "location": 2,
      "content": "อีกฝ่ายเป็นมนุษย์ใช่ไหม"
    },
    {
      "from": 3242.97,
      "to": 3244.76,
      "location": 2,
      "content": "ทาเครุคุงใจร้ายจัง"
    },
    {
      "from": 3244.97,
      "to": 3246.6,
      "location": 2,
      "content": "คงจะไม่เชื่อกันสินะ"
    },
    {
      "from": 3246.81,
      "to": 3249.233,
      "location": 2,
      "content": "เห็นแบบนี้ผมแก่ที่สุดในนี้เชียวนะ"
    },
    {
      "from": 3249.31,
      "to": 3252.73,
      "location": 2,
      "content": "เพราะฉะนั้นเลยมีสิทธิ์\nที่จะคว้าความสุขไว้เป็นคนแรกไง"
    },
    {
      "from": 3252.98,
      "to": 3255.433,
      "location": 2,
      "content": "ทุกคน มาเชื่อเขากันเถอะ"
    },
    {
      "from": 3255.82,
      "to": 3256.94,
      "location": 2,
      "content": "เชื่อแล้วกัน"
    },
    {
      "from": 3257.2,
      "to": 3260.15,
      "location": 2,
      "content": "ไม่เห็นจะเชื่อเลยสักนิดนี่หว่า!"
    },
    {
      "from": 3262.91,
      "to": 3265.1,
      "location": 2,
      "content": "มีมี่ ฉันมาแล้วนะ"
    },
    {
      "from": 3265.24,
      "to": 3266.2,
      "location": 2,
      "content": "พัลมอน?"
    },
    {
      "from": 3266.41,
      "to": 3268.6,
      "location": 2,
      "content": "ปิโยมอนกับเทลมอนก็มาด้วยนะ"
    },
    {
      "from": 3268.75,
      "to": 3269.733,
      "location": 2,
      "content": "ตรงนั้นไง"
    },
    {
      "from": 3271.42,
      "to": 3272.92,
      "location": 2,
      "content": "- ปิโยมอน\n- เทลมอน"
    },
    {
      "from": 3277.76,
      "to": 3280.433,
      "location": 2,
      "content": "เป็นเพื่อนที่แปลกจังนะ"
    },
    {
      "from": 3286.89,
      "to": 3289.02,
      "location": 2,
      "content": "เชิญเข้ามากินตามสบายเลยนะ"
    },
    {
      "from": 3289.56,
      "to": 3291.85,
      "location": 2,
      "content": "จะทานแล้วนะคะ"
    },
    {
      "from": 3294.73,
      "to": 3296.533,
      "location": 2,
      "content": "ว้าว อร่อยจัง"
    },
    {
      "from": 3296.73,
      "to": 3299.966,
      "location": 2,
      "content": "หลังจากที่กลับมา ฉันก็อยากกินมาตลอดเลย"
    },
    {
      "from": 3300.1,
      "to": 3301,
      "location": 2,
      "content": "สุดยอด"
    },
    {
      "from": 3301.033,
      "to": 3301.8,
      "location": 2,
      "content": "นั่นสิเนอะ"
    },
    {
      "from": 3301.9,
      "to": 3305.03,
      "location": 2,
      "content": "อดใจไม่ไหวกับน้ำซุปที่มีรสสัมผัสที่เหนียวนุ่ม\nและละลายในปาก"
    },
    {
      "from": 3305.41,
      "to": 3307.2,
      "location": 2,
      "content": "จริงด้วย ๆ"
    },
    {
      "from": 3308.58,
      "to": 3310.933,
      "location": 2,
      "content": "เอ๊ะ เมื่อกี้พูดว่าอะไรนะ"
    },
    {
      "from": 3311.08,
      "to": 3312.8,
      "location": 2,
      "content": "เรื่องของไทจิกับยามาโตะน่ะ"
    },
    {
      "from": 3312.92,
      "to": 3315.266,
      "location": 2,
      "content": "ไม่เห็นเป็นไรเลย ปล่อยเขาไปเถอะ"
    },
    {
      "from": 3315.46,
      "to": 3316.3,
      "location": 2,
      "content": "แต่ว่า..."
    },
    {
      "from": 3316.466,
      "to": 3317.8,
      "location": 2,
      "content": "เป็นห่วงอยู่จริงด้วยสินะ"
    },
    {
      "from": 3318.133,
      "to": 3321.066,
      "location": 2,
      "content": "ทั้งสองคนนี่โตเป็นหนุ่มหล่อไม่เบาเลยนะ"
    },
    {
      "from": 3321.26,
      "to": 3323.22,
      "location": 2,
      "content": "จะเอายังไงดีล่ะ คุณโซระ"
    },
    {
      "from": 3329.47,
      "to": 3330.966,
      "location": 2,
      "content": "\"หนุ่มหล่อ\" คืออะไรเหรอ"
    },
    {
      "from": 3331.1,
      "to": 3332.89,
      "location": 2,
      "content": "ฉันก็ไม่ค่อยเข้าใจเหมือนกัน"
    },
    {
      "from": 3333.3,
      "to": 3338.266,
      "location": 2,
      "content": "เอ๋ ถ้างั้นปิโยะชอบสไตล์แบบไหนล่ะ"
    },
    {
      "from": 3338.27,
      "to": 3339.57,
      "location": 2,
      "content": "คืองี้นะ..."
    },
    {
      "from": 3340.61,
      "to": 3342.8,
      "location": 2,
      "content": "หมายถึงแบบเส้นใหญ่หรือเส้นเล็กเหรอ"
    },
    {
      "from": 3342.95,
      "to": 3345.566,
      "location": 2,
      "content": "เหมือนโซระจะชอบเส้นหยักแหละ"
    },
    {
      "from": 3345.866,
      "to": 3347.24,
      "location": 2,
      "content": "คุณโมจิซึกิ?"
    },
    {
      "from": 3349.12,
      "to": 3351.233,
      "location": 2,
      "content": "ขอเพิ่มด้วยค่ะ พลีส!"
    },
    {
      "from": 3351.45,
      "to": 3353.21,
      "location": 2,
      "content": "ทางนี้ก็ด้วย พลีส!"
    },
    {
      "from": 3353.41,
      "to": 3356.08,
      "location": 2,
      "content": "ได้จ้ะ รอเดี๋ยวนะ"
    },
    {
      "from": 3358.13,
      "to": 3359.59,
      "location": 2,
      "content": "ขอโทษนะคะ"
    },
    {
      "from": 3373.52,
      "to": 3375.033,
      "location": 2,
      "content": "นายมาทำอะไรที่นี่"
    },
    {
      "from": 3375.1,
      "to": 3376.44,
      "location": 2,
      "content": "ฉันต่างหากที่ต้องถาม"
    },
    {
      "from": 3377.15,
      "to": 3381.666,
      "location": 2,
      "content": "ฉันจะมาเช็กดูอีกรอบ\nว่าอาจารย์นิชิจิมะมาหรือยัง"
    },
    {
      "from": 3385.49,
      "to": 3386.45,
      "location": 2,
      "content": "ว่าไง"
    },
    {
      "from": 3387.266,
      "to": 3389.06,
      "location": 2,
      "content": "สำนักประมวลผล... ยาวชะมัด"
    },
    {
      "from": 3389.16,
      "to": 3392.83,
      "location": 2,
      "content": "สำนักประมวลผลข้อมูลแห่งชาติ\nสังกัดองค์กรบริหารอิสระ"
    },
    {
      "from": 3393.04,
      "to": 3395.96,
      "location": 2,
      "content": "แผนกกลยุทธ์ข้อมูล หน่วยจัดการข้อมูล"
    },
    {
      "from": 3396.17,
      "to": 3399.46,
      "location": 2,
      "content": "เจ้าหน้าที่บริหารชั้นที่ 2 นิชิจิมะ ไดโกะ"
    },
    {
      "from": 3400.84,
      "to": 3402.933,
      "location": 2,
      "content": "ไม่ใช่อาจารย์เหรอครับ"
    },
    {
      "from": 3403.01,
      "to": 3405.133,
      "location": 2,
      "content": "อาชีพหลักก็ตามนามบัตรนั่นแหละ"
    },
    {
      "from": 3405.51,
      "to": 3409.566,
      "location": 2,
      "content": "หมู่นี้ได้เกิดการบิดเบือน\nระหว่างดิจิตอลเวิลด์และโลกของพวกเรา"
    },
    {
      "from": 3409.68,
      "to": 3413.14,
      "location": 2,
      "content": "พวกดิจิตอลมอนสเตอร์\nเลยปรากฏตัวออกจากที่อื่นนอกเหนือจากดิจิตอลเกท"
    },
    {
      "from": 3414.85,
      "to": 3419.65,
      "location": 2,
      "content": "ถึงแม้ที่ผ่านมาเราจะหาทางรับมือไปแล้ว\nแต่พวกมันก็เริ่มมีกำลังแข็งแกร่งมากขึ้น"
    },
    {
      "from": 3420.19,
      "to": 3422.65,
      "location": 2,
      "content": "ดังนั้นเราถึงได้ขอให้พวกเธอช่วยไง"
    },
    {
      "from": 3422.86,
      "to": 3425.15,
      "location": 2,
      "content": "พวกเราเรียกมันว่า \"ดิจิมอนติดเชื้อ\""
    },
    {
      "from": 3425.36,
      "to": 3426.733,
      "location": 2,
      "content": "ดิจิมอนติดเชื้อ?"
    },
    {
      "from": 3427.533,
      "to": 3430.288,
      "location": 2,
      "content": "เป็นสภาวะที่ดิจิตอลมอนสเตอร์\nได้รับอิทธิพลรุนแรงบางอย่าง"
    },
    {
      "from": 3430.312,
      "to": 3434.16,
      "location": 2,
      "content": "เกิดสูญเสียการควบคุมจนคลุ้มคลั่ง"
    },
    {
      "from": 3434.7,
      "to": 3436.83,
      "location": 2,
      "content": "เพราะงั้นเราถึงได้เรียกมันว่า\n\"ดิจิมอนติดเชื้อ\""
    },
    {
      "from": 3437.04,
      "to": 3437.966,
      "location": 2,
      "content": "แล้วสาเหตุล่ะ?"
    },
    {
      "from": 3438.04,
      "to": 3440.5,
      "location": 2,
      "content": "ขอโทษด้วยนะ พวกเราก็ยังไม่รู้เหมือนกัน"
    },
    {
      "from": 3440.54,
      "to": 3444.51,
      "location": 2,
      "content": "ต้องทำยังไงถึงจะทำให้ดิจิมอนติดเชื้อพวกนั้น\nกลับมาเป็นแบบเดิมเหรอครับ"
    },
    {
      "from": 3444.71,
      "to": 3449.866,
      "location": 2,
      "content": "ก็ไม่รู้สินะ อาจจะมีความเป็นไปได้\nแต่พวกเราก็ยังไม่รู้วิธีเลย"
    },
    {
      "from": 3449.89,
      "to": 3451.8,
      "location": 2,
      "content": "มีแต่เรื่องที่ไม่รู้ทั้งนั้นเลย"
    },
    {
      "from": 3452.8,
      "to": 3456.933,
      "location": 2,
      "content": "เอาเป็นว่าตอนนี้\nเราก็มีแต่ต้องขับไล่พวกมันออกไปโดยเร็ว"
    },
    {
      "from": 3456.96,
      "to": 3459.5,
      "location": 2,
      "content": "เพื่อไม่ให้โลกเกิดความเสียหาย\nไปมากกว่านี้เท่านั้น"
    },
    {
      "from": 3459.56,
      "to": 3463.5,
      "location": 2,
      "content": "ว่าแต่.. ทำไมพวกอาจารย์\nถึงรู้เรื่องแบบนี้หลายอย่างเลยล่ะ"
    },
    {
      "from": 3463.9,
      "to": 3466.19,
      "location": 2,
      "content": "รู้แม้กระทั่งเรื่องของพวกผมด้วย"
    },
    {
      "from": 3466.4,
      "to": 3468.6,
      "location": 2,
      "content": "หลังจากเกิดเหตุการณ์ที่ฮิคาริงาโอกะและโอไดบะ"
    },
    {
      "from": 3468.74,
      "to": 3471.4,
      "location": 2,
      "content": "คนที่รู้เรื่องดิจิมอน\nก็มีเพิ่มขึ้นอย่างต่อเนื่อง"
    },
    {
      "from": 3471.91,
      "to": 3475.2,
      "location": 2,
      "content": "หลังจากที่ได้รับการติดต่อ\nจากคนที่ชื่อว่า \"เก็นไน\""
    },
    {
      "from": 3475.41,
      "to": 3479.04,
      "location": 2,
      "content": "พวกเราจึงดำเนินการวิจัยอย่างเป็นระบบ\nเกี่ยวกับดิจิตอลมอนสเตอร์"
    },
    {
      "from": 3480.25,
      "to": 3482.233,
      "location": 2,
      "content": "รู้จักกับคุณเก็นไนนี่เอง"
    },
    {
      "from": 3482.25,
      "to": 3484.681,
      "location": 2,
      "content": "พวกเราก็แค่ได้รับข้อมูลมาจากอีกฝ่ายเท่านั้น"
    },
    {
      "from": 3484.705,
      "to": 3487.533,
      "location": 2,
      "content": "แต่ดูเหมือนเขา\nจะเป็นคนที่รู้เรื่องของพวกเธอดีเลยนะ"
    },
    {
      "from": 3488.26,
      "to": 3490.89,
      "location": 2,
      "content": "เมื่อก่อนเขาเคยช่วยเหลือพวกเราน่ะ"
    },
    {
      "from": 3491.43,
      "to": 3495.166,
      "location": 2,
      "content": "ยังไงก็ตาม หากครั้งต่อไปมีดิจิมอนติดเชื้อ\nที่มีกำลังแข็งแกร่งโผล่ออกมา"
    },
    {
      "from": 3495.2,
      "to": 3498.23,
      "location": 2,
      "content": "พวกเราอาจจะขอความช่วยเหลือจากพวกเธออีกก็ได้"
    },
    {
      "from": 3498.94,
      "to": 3500.366,
      "location": 2,
      "content": "รบกวนด้วยนะ"
    },
    {
      "from": 3500.44,
      "to": 3502.56,
      "location": 2,
      "content": "ได้ เข้าใจแล้ว"
    },
    {
      "from": 3509.78,
      "to": 3511.648,
      "location": 2,
      "content": "ตอนนี้ประเทศอื่น ๆ\nกำลังเรียกร้อง"
    },
    {
      "from": 3511.672,
      "to": 3514.833,
      "location": 2,
      "content": "ให้เปิดเผยข้อมูล\nเกี่ยวกับดิจิตอลมอนสเตอร์เพิ่มมากขึ้น"
    },
    {
      "from": 3514.9,
      "to": 3517,
      "location": 2,
      "content": "ตอนนี้เรายังมีข้อมูลไม่เพียงพอค่ะ"
    },
    {
      "from": 3517.16,
      "to": 3520.58,
      "location": 2,
      "content": "ผู้เสนอข้อมูลที่เรียกว่าเก็นไน\nเป็นยังไงบ้างล่ะ"
    },
    {
      "from": 3520.79,
      "to": 3523.58,
      "location": 2,
      "content": "ทางเราติดต่อเขาไม่ได้เลยค่ะ"
    },
    {
      "from": 3523.96,
      "to": 3527.26,
      "location": 2,
      "content": "ยังไงก็รีบรวบรวมเอกสารที่ส่งต่อได้ให้ล่ะ"
    },
    {
      "from": 3527.46,
      "to": 3528.92,
      "location": 2,
      "content": "รับทราบแล้วค่ะ"
    },
    {
      "from": 3531.76,
      "to": 3532.666,
      "location": 2,
      "content": "สวัสดีค่ะ"
    },
    {
      "from": 3532.8,
      "to": 3535.43,
      "location": 2,
      "content": "เล่าเรื่องนั้นให้พวกเด็ก ๆ ฟังแล้วนะครับ"
    },
    {
      "from": 3535.64,
      "to": 3536.72,
      "location": 2,
      "content": "เข้าใจแล้ว"
    },
    {
      "from": 3539.81,
      "to": 3543.8,
      "location": 2,
      "content": "นี่ คุณโคชิโร่\nไม่ได้มาเพื่อซื้อเสื้อผ้าหรอกเหรอ"
    },
    {
      "from": 3543.98,
      "to": 3548,
      "location": 2,
      "content": "ต่อให้ไม่ไปที่ร้าน ผมก็มีพันธมิตรสุดแกร่ง\nที่เรียกว่าช้อปปิ้งออนไลน์อยู่แล้วครับ"
    },
    {
      "from": 3548.48,
      "to": 3549.5,
      "location": 2,
      "content": "ช้อปปิ้งออนไลน์?"
    },
    {
      "from": 3549.65,
      "to": 3554.62,
      "location": 2,
      "content": "ถึงจะเป็นเรื่องที่น่าอายไปหน่อย\nที่ผ่านมาแม่ของผมคอยซื้อเสื้อผ้าให้หมดเลยครับ"
    },
    {
      "from": 3554.99,
      "to": 3556.975,
      "location": 2,
      "content": "แต่ตอนนี้ก็เป็นนักเรียนมัธยมปลายแล้วด้วย"
    },
    {
      "from": 3556.999,
      "to": 3559.433,
      "location": 2,
      "content": "เลยคิดว่าจะลองเลือกเสื้อผ้า\nด้วยตัวเองเป็นครั้งแรก"
    },
    {
      "from": 3559.466,
      "to": 3560.8,
      "location": 2,
      "content": "อืม ก็ดีแล้วนี่นา"
    },
    {
      "from": 3560.83,
      "to": 3565.433,
      "location": 2,
      "content": "แต่ว่าการคุยโต้ตอบกับพนักงาน\nนี่มันหนักหนาเกินไปสำหรับผมจริง ๆ ครับ"
    },
    {
      "from": 3565.5,
      "to": 3566.46,
      "location": 2,
      "content": "อย่างนี้นี่เอง"
    },
    {
      "from": 3566.67,
      "to": 3569.233,
      "location": 2,
      "content": "ถ้าสั่งซื้อทางออนไลน์\nผมก็จะสามารถซื้อได้ง่ายด้วย"
    },
    {
      "from": 3569.34,
      "to": 3572.466,
      "location": 2,
      "content": "อ๊ะ เหตุผลที่จู่ ๆ คุณก็ตามเทรนด์แฟชั่นขึ้นมา"
    },
    {
      "from": 3573.01,
      "to": 3575.8,
      "location": 2,
      "content": "มันไม่ได้มีความหมายอะไรลึกซึ้งจริงเหรอครับ"
    },
    {
      "from": 3576.8,
      "to": 3578.933,
      "location": 2,
      "content": "อ๋อ เป็นเพราะคุณมีมี่เหรอ"
    },
    {
      "from": 3586.52,
      "to": 3590.82,
      "location": 2,
      "content": "ผมถือโอกาสพัฒนาโปรแกรมแต่งตัว\nที่จำลองสรีระของผมได้แม่นยำไปด้วยน่ะครับ"
    },
    {
      "from": 3591.36,
      "to": 3594.82,
      "location": 2,
      "content": "ถ้ากรอกไซส์เสื้อผ้ากับสีตรงนี้"
    },
    {
      "from": 3595.03,
      "to": 3595.99,
      "location": 2,
      "content": "เห็นไหมล่ะ"
    },
    {
      "from": 3599,
      "to": 3600.362,
      "location": 2,
      "content": "ฮือ ไม่นึกมาก่อนเลยว่า"
    },
    {
      "from": 3600.386,
      "to": 3603.433,
      "location": 2,
      "content": "วันที่คุณโคชิโร่ค้นหาเสื้อผ้าทันสมัยจะมาถึง"
    },
    {
      "from": 3603.54,
      "to": 3605.966,
      "location": 2,
      "content": "เท็นโตมอน อย่าร้องไห้เลยนะ"
    },
    {
      "from": 3614.05,
      "to": 3615.51,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 3618.39,
      "to": 3620.01,
      "location": 2,
      "content": "กำลังทำอะไรอยู่เหรอ"
    },
    {
      "from": 3623.73,
      "to": 3625.35,
      "location": 2,
      "content": "ไทจิ?"
    },
    {
      "from": 3642.58,
      "to": 3645.04,
      "location": 2,
      "content": "เป็นอะไรไปเหรอ ยามาโตะ"
    },
    {
      "from": 3646.58,
      "to": 3648.38,
      "location": 2,
      "content": "เจ้าบ้าไทจิ"
    },
    {
      "from": 3650.92,
      "to": 3654.05,
      "location": 2,
      "content": "ทุกคนเปลี่ยนกันไปหมดแล้วหรือเปล่านะ"
    },
    {
      "from": 3657.09,
      "to": 3658.55,
      "location": 2,
      "content": "ยามาโตะ..."
    },
    {
      "from": 3662.93,
      "to": 3665.06,
      "location": 2,
      "content": "ยามาโตะนี่ไม่เปลี่ยนไปเลยแฮะ"
    },
    {
      "from": 3666.77,
      "to": 3669.73,
      "location": 2,
      "content": "ไม่แปลกหรอกที่หมอนั่นจะโกรธฉัน"
    },
    {
      "from": 3672.27,
      "to": 3674.57,
      "location": 2,
      "content": "ฉันกำลังทำผิดอยู่หรือเปล่านะ"
    },
    {
      "from": 3676.95,
      "to": 3678.07,
      "location": 2,
      "content": "คิดว่าไงบ้าง"
    },
    {
      "from": 3680.12,
      "to": 3682.133,
      "location": 2,
      "content": "ไม่รู้อะ"
    },
    {
      "from": 3695.13,
      "to": 3696.42,
      "location": 2,
      "content": "ฉันกลัวน่ะ"
    },
    {
      "from": 3698.47,
      "to": 3701.43,
      "location": 2,
      "content": "ฉันได้ทำลายสิ่งต่าง ๆ\nในระหว่างที่ตัวเองไม่รู้"
    },
    {
      "from": 3702.3,
      "to": 3703.93,
      "location": 2,
      "content": "ไม่ใช่แค่สิ่งก่อสร้างหรอก"
    },
    {
      "from": 3704.97,
      "to": 3706.43,
      "location": 2,
      "content": "ผู้คนด้วย"
    },
    {
      "from": 3707.31,
      "to": 3709.6,
      "location": 2,
      "content": "ฉันอาจจะเผลอฆ่าใครไปก็ได้"
    },
    {
      "from": 3712.48,
      "to": 3716.44,
      "location": 2,
      "content": "นี่ฉัน...มาพูดอะไรเอาป่านนี้กันนะ"
    },
    {
      "from": 3717.65,
      "to": 3719.366,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 3731.67,
      "to": 3734.433,
      "location": 2,
      "content": "เอ๊ะ พี่พาอากูมอนมาด้วยเหรอ"
    },
    {
      "from": 3734.766,
      "to": 3735.16,
      "location": 2,
      "content": "ใช่"
    },
    {
      "from": 3735.34,
      "to": 3738.63,
      "location": 2,
      "content": "ทั้งที่หนูอุตส่าห์ให้พวกเทลมอน\nอยู่เฝ้าบ้านเนี่ยนะ"
    },
    {
      "from": 3740.84,
      "to": 3742.8,
      "location": 2,
      "content": "ยามาโตะบอกว่ามีธุระน่ะ"
    },
    {
      "from": 3743.01,
      "to": 3745.47,
      "location": 2,
      "content": "รุ่นพี่โจก็ติดต่อว่ามาไม่ได้เหมือนกัน"
    },
    {
      "from": 3745.68,
      "to": 3747.266,
      "location": 2,
      "content": "เจ้านี่คือห้องที่พวกนายพูดถึงกันเหรอ"
    },
    {
      "from": 3747.35,
      "to": 3749.48,
      "location": 2,
      "content": "ใช่ครับ ออฟฟิศที่ผมภาคภูมิใจครับ"
    },
    {
      "from": 3749.69,
      "to": 3752.15,
      "location": 2,
      "content": "เป็นห้องที่อลังการสุดยอดเลยนะ"
    },
    {
      "from": 3755.19,
      "to": 3756.966,
      "location": 2,
      "content": "สวัสดี ใครเหรอครับ"
    },
    {
      "from": 3757.03,
      "to": 3758.15,
      "location": 2,
      "content": "ฉันเอง"
    },
    {
      "from": 3761.53,
      "to": 3764.49,
      "location": 2,
      "content": "สวัสดีจ้ะ เป็นแมนชั่นที่สุดยอดเลยนะ"
    },
    {
      "from": 3764.7,
      "to": 3766.33,
      "location": 2,
      "content": "เห็นว่าเป็นออฟฟิศของคุณโคชิโร่น่ะ"
    },
    {
      "from": 3766.54,
      "to": 3768.66,
      "location": 2,
      "content": "โอ้โห จริงเหรอเนี่ย"
    },
    {
      "from": 3769.04,
      "to": 3770.9,
      "location": 2,
      "content": "พวกเราก็เพิ่งเคยเข้ามาครั้งแรกเลย"
    },
    {
      "from": 3771.04,
      "to": 3774.333,
      "location": 2,
      "content": "ผมกำลังช่วยงานบริษัท\nที่คนรู้จักชาวอเมริกันก่อตั้งขึ้นน่ะครับ"
    },
    {
      "from": 3774.38,
      "to": 3776.333,
      "location": 2,
      "content": "สุดยอด สมแล้วที่เป็นนาย"
    },
    {
      "from": 3777.55,
      "to": 3780.84,
      "location": 2,
      "content": "สิ่งที่ฉันฟังมาจากอาจารย์ก็มีเท่านี้แหละ"
    },
    {
      "from": 3781.05,
      "to": 3783.51,
      "location": 2,
      "content": "ดิจิมอนติดเชื้อเหรอครับ"
    },
    {
      "from": 3783.8,
      "to": 3787.266,
      "location": 2,
      "content": "อาจจะปรากฏตัวอีกครั้งก็ได้เนี่ย\nชวนให้หงุดหงิดจังเลยเนอะ"
    },
    {
      "from": 3787.39,
      "to": 3790.833,
      "location": 2,
      "content": "ฉันรู้สึกโล่งใจจริง ๆ ที่พวกปิโยมอนมาที่นี่นะ"
    },
    {
      "from": 3790.933,
      "to": 3794.86,
      "location": 2,
      "content": "คุณโคชิโร่ เอาไอ้นั่นให้ทุกคนดูเลยดีไหมครับ"
    },
    {
      "from": 3795.06,
      "to": 3797.69,
      "location": 2,
      "content": "อ้อ จริงด้วยสินะ"
    },
    {
      "from": 3798.07,
      "to": 3799.86,
      "location": 2,
      "content": "อ้าว ขออนุญาตสักครู่นะครับ"
    },
    {
      "from": 3804.07,
      "to": 3806.03,
      "location": 2,
      "content": "นี่แน่ะ เข้าไปเลย"
    },
    {
      "from": 3807.08,
      "to": 3808.37,
      "location": 2,
      "content": "- อากูมอน?\n- ปิโยมอน!"
    },
    {
      "from": 3808.58,
      "to": 3810.87,
      "location": 2,
      "content": "ไม่ต้องห่วง เขาอยู่ตรงนั้น"
    },
    {
      "from": 3815.42,
      "to": 3819.05,
      "location": 2,
      "content": "ผมลองสร้างไซเบอร์สเปซ\nแบบเสมือนจริงในเซิร์ฟเวอร์นี้ขึ้นมาครับ"
    },
    {
      "from": 3819.26,
      "to": 3823.72,
      "location": 2,
      "content": "ผมคิดว่าเราจำเป็นต้องมีสถานที่\nให้ดิจิมอนหลบหนีได้ในยามฉุกเฉินครับ"
    },
    {
      "from": 3826.93,
      "to": 3828.5,
      "location": 2,
      "content": "เมลจากปิโยมอนนี่นา"
    },
    {
      "from": 3828.76,
      "to": 3831.73,
      "location": 2,
      "content": "เอ่อ เจ้านี่เปิดอ่านยังไงเหรอ"
    },
    {
      "from": 3833.94,
      "to": 3836.333,
      "location": 2,
      "content": "มีเมลจากอากูมอนถึงพี่ด้วยนะ"
    },
    {
      "from": 3836.61,
      "to": 3840.466,
      "location": 2,
      "content": "เราสามารถพูดคุยกันผ่านทางอีเมล\nหรือจอมอนิเตอร์ได้ด้วยนะครับ"
    },
    {
      "from": 3840.766,
      "to": 3842.74,
      "location": 2,
      "content": "โอ้โห สะดวกจัง"
    },
    {
      "from": 3843.61,
      "to": 3845.07,
      "location": 2,
      "content": "ออกมาได้ด้วยเหรอ"
    },
    {
      "from": 3848.45,
      "to": 3849.5,
      "location": 2,
      "content": "ไม่มีปัญหา"
    },
    {
      "from": 3849.6,
      "to": 3850.633,
      "location": 2,
      "content": "โล่งอกไปที"
    },
    {
      "from": 3850.95,
      "to": 3852.91,
      "location": 2,
      "content": "เราใช้มือถือเรียกออกมาได้หรือเปล่า"
    },
    {
      "from": 3853.12,
      "to": 3855.5,
      "location": 2,
      "content": "ความเร็วในการประมวลผล\nของมือถือยังมีไม่มากพอครับ"
    },
    {
      "from": 3855.79,
      "to": 3857.047,
      "location": 2,
      "content": "ถ้าใช้โน้ตบุ๊คของผม"
    },
    {
      "from": 3857.071,
      "to": 3860.666,
      "location": 2,
      "content": "พวกเขาก็จะสัญจรไปมา\nในไซเบอร์สเปซเสมือนจริงของที่นี่ได้"
    },
    {
      "from": 3860.8,
      "to": 3863.366,
      "location": 2,
      "content": "ผ่านจอมอนิเตอร์ยักษ์\nที่เชื่อมกับระบบเน็ตเวิร์กครับ"
    },
    {
      "from": 3863.47,
      "to": 3865.93,
      "location": 2,
      "content": "ถ้างั้นเราก็เรียกพวกเขาได้ทุกเวลาเลยใช่ไหม"
    },
    {
      "from": 3866.14,
      "to": 3871.1,
      "location": 2,
      "content": "ใช่ครับ ตามปกติพวกเขาก็คงจะอยู่ในห้องของผม\nหรือไม่ก็ไซเบอร์สเปซของเซิร์ฟเวอร์"
    },
    {
      "from": 3871.31,
      "to": 3873.77,
      "location": 2,
      "content": "อ๊ะ ป่านนี้แล้วเหรอ"
    },
    {
      "from": 3874.1,
      "to": 3876.1,
      "location": 2,
      "content": "เราต้องกลับแล้วสิ"
    },
    {
      "from": 3876.77,
      "to": 3880.07,
      "location": 2,
      "content": "อะไรกัน คืนดีกับคุณไทจิแล้วเหรอ"
    },
    {
      "from": 3880.27,
      "to": 3883.94,
      "location": 2,
      "content": "ผมเห็นว่าวันนี้พี่ไม่มา\nเลยคิดว่างอนไปแล้วซะอีก"
    },
    {
      "from": 3884.61,
      "to": 3886.11,
      "location": 2,
      "content": "ไม่ได้งอนสักหน่อย"
    },
    {
      "from": 3886.32,
      "to": 3889.28,
      "location": 2,
      "content": "พวกเขาบอกว่าให้ทุกคน\nมารวมตัวกันอีกครั้งในวันเสาร์น่ะ"
    },
    {
      "from": 3889.49,
      "to": 3892.33,
      "location": 2,
      "content": "คราวหน้าก็มาด้วยละ วางก่อนนะ"
    },
    {
      "from": 3897.9,
      "to": 3905.5,
      "location": 2,
      "content": "(คุวากามอนปรากฏตัวที่โตเกียว ระวังตัวด้วยนะ)"
    },
    {
      "from": 3908.01,
      "to": 3909.966,
      "location": 2,
      "content": "คุณโคชิโร่โต้รุ่งเหรอ"
    },
    {
      "from": 3910.01,
      "to": 3911.81,
      "location": 2,
      "content": "นายควรนอนให้เต็มอิ่มนะ"
    },
    {
      "from": 3912.01,
      "to": 3916.35,
      "location": 2,
      "content": "ผมนอนมาประมาณสามชั่วโมงแล้วครับ\nในที่สุดก็ทำเสร็จสักทีครับ"
    },
    {
      "from": 3916.69,
      "to": 3919.266,
      "location": 2,
      "content": "ลองใส่ดูนะครับ คุณไทจิ"
    },
    {
      "from": 3919.36,
      "to": 3920.133,
      "location": 2,
      "content": "ได้สิ"
    },
    {
      "from": 3923.53,
      "to": 3924.643,
      "location": 2,
      "content": "ตามหลักทฤษฎีแล้ว"
    },
    {
      "from": 3924.667,
      "to": 3928.03,
      "location": 2,
      "content": "คุณสามารถใช้สิ่งนี้\nตรวจจับความบิดเบือนของมิติได้ครับ"
    },
    {
      "from": 3930.2,
      "to": 3931.99,
      "location": 2,
      "content": "นี่ ไทจิ"
    },
    {
      "from": 3932.2,
      "to": 3935.83,
      "location": 2,
      "content": "พวกเราจะกลับไปห้องเซิร์ฟเวอร์\nที่โคชิโร่สร้างให้นะ"
    },
    {
      "from": 3936.04,
      "to": 3938.67,
      "location": 2,
      "content": "เข้าจากโน้ตบุ๊คของคุณโคชิโร่ได้สินะ"
    },
    {
      "from": 3938.87,
      "to": 3942.966,
      "location": 2,
      "content": "ตราบใดที่มีมอนิเตอร์เชื่อมกับอินเทอร์เน็ต\nพวกเขาก็สามารถมาจากทางนั้นได้อยู่แล้วครับ"
    },
    {
      "from": 3945.05,
      "to": 3946.88,
      "location": 2,
      "content": "ตรงนั้นน่าจะใช้ได้นะครับ"
    },
    {
      "from": 3947.22,
      "to": 3949.01,
      "location": 2,
      "content": "ถ้ามีอะไรเกิดขึ้นก็เรียกเรานะ"
    },
    {
      "from": 3949.22,
      "to": 3950.22,
      "location": 2,
      "content": "ได้เลย"
    },
    {
      "from": 3952.55,
      "to": 3955.18,
      "location": 2,
      "content": "แล้วพวกเราจะต้องทำยังไงเหรอ"
    },
    {
      "from": 3955.39,
      "to": 3956.68,
      "location": 2,
      "content": "ผลที่ได้จากการตรวจสอบ..."
    },
    {
      "from": 3956.89,
      "to": 3958.582,
      "location": 2,
      "content": "ดูเหมือนว่าการบิดเบือนครั้งนี้"
    },
    {
      "from": 3958.606,
      "to": 3961.433,
      "location": 2,
      "content": "จะเกิดขึ้นในสถานที่\nที่มีข้อมูลกระจุกตัวกันอยู่ครับ"
    },
    {
      "from": 3961.94,
      "to": 3966.28,
      "location": 2,
      "content": "เป็นกลไกที่ทำให้เราเห็นการไหลเวียนของข้อมูล\nหากมองผ่านแว่นกันลมอันนี้ครับ"
    },
    {
      "from": 3968.11,
      "to": 3971.24,
      "location": 2,
      "content": "แถมยังช่วยให้รู้ถึงพละกำลัง\nและชนิดของข้อมูลผ่านสีด้วยครับ"
    },
    {
      "from": 3971.45,
      "to": 3974.95,
      "location": 2,
      "content": "ยกตัวอย่างเช่น...\nถ้ามันเชื่อมต่อกับเซิร์ฟเวอร์แบบนี้"
    },
    {
      "from": 3975.95,
      "to": 3978.96,
      "location": 2,
      "content": "จริงด้วย แสงสว่างจ้าขึ้นมาเลย"
    },
    {
      "from": 3979.46,
      "to": 3981.76,
      "location": 2,
      "content": "จุดที่มีสีแดงเข้มคือการรวมตัวของกลุ่มข้อมูล"
    },
    {
      "from": 3981.784,
      "to": 3984.3,
      "location": 2,
      "content": "ซึ่งน่าจะเกี่ยวข้องกับ\nการบิดเบือนในครั้งนี้ครับ"
    },
    {
      "from": 3985.46,
      "to": 3987.935,
      "location": 2,
      "content": "ดูจะมีความเป็นไปได้สูงที่ดิจิมอนติดเชื้อ"
    },
    {
      "from": 3987.959,
      "to": 3990.433,
      "location": 2,
      "content": "จะโผล่มาจากสถานที่\nที่เกิดการบิดเบือนขนาดใหญ่ครับ"
    },
    {
      "from": 3990.47,
      "to": 3992.59,
      "location": 2,
      "content": "อ๋อ อย่างนี้นี่เอง"
    },
    {
      "from": 3992.8,
      "to": 3996.333,
      "location": 2,
      "content": "ถ้างั้นเรามาตรวจสอบ\nความบิดเบือนทั่วทั้งบริเวณโดยรอบนี้"
    },
    {
      "from": 3996.433,
      "to": 3999.833,
      "location": 2,
      "content": "แล้วเช็กให้แน่ใจล่วงหน้า\nว่ามีสถานที่อันตรายอยู่หรือเปล่ากันเถอะครับ"
    },
    {
      "from": 4000.31,
      "to": 4001.15,
      "location": 2,
      "content": "เอ๊ะ?"
    },
    {
      "from": 4004.15,
      "to": 4005.48,
      "location": 2,
      "content": "มีอะไรเหรอ"
    },
    {
      "from": 4006.98,
      "to": 4008.32,
      "location": 2,
      "content": "เกิดอะไรขึ้นเหรอ"
    },
    {
      "from": 4011.16,
      "to": 4012.99,
      "location": 2,
      "content": "เอ่อ คือว่า..."
    },
    {
      "from": 4013.32,
      "to": 4015.466,
      "location": 2,
      "content": "กำลังหาของอยู่น่ะค่ะ"
    },
    {
      "from": 4015.63,
      "to": 4017.6,
      "location": 2,
      "content": "แต่ฉันก็ดันหลงทางจนได้"
    },
    {
      "from": 4017.66,
      "to": 4019.5,
      "location": 2,
      "content": "เดี๋ยวพวกเรานำทางให้เอาไหม"
    },
    {
      "from": 4019.83,
      "to": 4020.83,
      "location": 2,
      "content": "แต่ว่า..."
    },
    {
      "from": 4021.17,
      "to": 4025.63,
      "location": 2,
      "content": "เอาเถอะน่า พวกเราก็กำลังหาซื้อของอยู่พอดีด้วย"
    },
    {
      "from": 4025.84,
      "to": 4027.17,
      "location": 2,
      "content": "ใช่แล้ว"
    },
    {
      "from": 4027.84,
      "to": 4028.7,
      "location": 2,
      "content": "อ้าว"
    },
    {
      "from": 4029.01,
      "to": 4030.84,
      "location": 2,
      "content": "รีบตามมาเร็วเข้า"
    },
    {
      "from": 4031.633,
      "to": 4035.2,
      "location": 2,
      "content": "จะว่าไป สิ่งที่คุณโมจิซึกิกำลังหาอยู่\nเป็นของแบบไหนเหรอ"
    },
    {
      "from": 4035.85,
      "to": 4039.52,
      "location": 2,
      "content": "คือว่า...จะบอกว่าเหมือนแมวหรือยังไงดี"
    },
    {
      "from": 4040.52,
      "to": 4042.02,
      "location": 2,
      "content": "เหมือนแมว?"
    },
    {
      "from": 4050.86,
      "to": 4053.53,
      "location": 2,
      "content": "คุณไทจิ แถวนี้เป็นยังไงบ้างครับ"
    },
    {
      "from": 4059.04,
      "to": 4060.633,
      "location": 2,
      "content": "ดูเหมือนจะปลอดภัยนะ"
    },
    {
      "from": 4067.88,
      "to": 4070.3,
      "location": 2,
      "content": "มาตามหาจนถึงที่แบบนี้เลยเหรอครับ"
    },
    {
      "from": 4070.7,
      "to": 4073.6,
      "location": 2,
      "content": "ขอโทษที ท้องหิวจนได้น่ะ"
    },
    {
      "from": 4073.88,
      "to": 4078.5,
      "location": 2,
      "content": "คนที่นั่งหลังจากแถวสี่ลงไป\nขืนไม่พยายามให้มากขึ้น เดี๋ยวจะสอบตกเอานะ"
    },
    {
      "from": 4080.22,
      "to": 4082.39,
      "location": 2,
      "content": "โธ่ ให้ตายสิ"
    },
    {
      "from": 4095.41,
      "to": 4097.41,
      "location": 2,
      "content": "คือว่า...ขอโทษนะคะ"
    },
    {
      "from": 4098.24,
      "to": 4100.87,
      "location": 2,
      "content": "เดี๋ยวหลังจากนี้ฉันจะลองหาเองดู"
    },
    {
      "from": 4101.08,
      "to": 4102.5,
      "location": 2,
      "content": "ไหวแน่เหรอ"
    },
    {
      "from": 4102.58,
      "to": 4104.92,
      "location": 2,
      "content": "ใช่ค่ะ ขอบคุณมากเลยค่ะ"
    },
    {
      "from": 4109.84,
      "to": 4111.21,
      "location": 2,
      "content": "นี่ โคชิโร่"
    },
    {
      "from": 4111.42,
      "to": 4112.92,
      "location": 2,
      "content": "มีอะไรเหรอครับ"
    },
    {
      "from": 4113.26,
      "to": 4117.133,
      "location": 2,
      "content": "แว่นกันลมอันนี้มองไกล ๆ ไม่ค่อยเห็นเลยนะ"
    },
    {
      "from": 4117.26,
      "to": 4120.166,
      "location": 2,
      "content": "ไม่มีวิธีที่จะทำให้หาได้หมดทีเดียวเหรอ"
    },
    {
      "from": 4120.26,
      "to": 4122.366,
      "location": 2,
      "content": "ถ้าไปที่สูงก็ไม่เลวเลยนะ"
    },
    {
      "from": 4122.43,
      "to": 4125.1,
      "location": 2,
      "content": "ที่สูง ๆ แถวนี้เหรอ..."
    },
    {
      "from": 4125.77,
      "to": 4127.27,
      "location": 2,
      "content": "ตรงนั้นสินะครับ"
    },
    {
      "from": 4130.94,
      "to": 4131.65,
      "location": 2,
      "content": "ไปสิ"
    },
    {
      "from": 4132.28,
      "to": 4133.44,
      "location": 2,
      "content": "ยามาโตะ?"
    },
    {
      "from": 4134.07,
      "to": 4135.57,
      "location": 2,
      "content": "อย่าผลักสิ"
    },
    {
      "from": 4135.78,
      "to": 4140.733,
      "location": 2,
      "content": "ให้ตายเถอะ นายนี่มันปากไม่ตรงกับใจเลยนะ\nฉันไปอยู่กับพวกอากูมอนแล้วกัน"
    },
    {
      "from": 4144.62,
      "to": 4146.066,
      "location": 2,
      "content": "ทำไมต้องเป็นชิงช้าสวรรค์ด้วย?"
    },
    {
      "from": 4146.233,
      "to": 4148.58,
      "location": 2,
      "content": "รายละเอียดไว้ถามกับไทจิเอานะ"
    },
    {
      "from": 4148.79,
      "to": 4149.96,
      "location": 2,
      "content": "เฮ้!"
    },
    {
      "from": 4150.46,
      "to": 4151.42,
      "location": 2,
      "content": "เดี๋ยวสิ"
    },
    {
      "from": 4151.63,
      "to": 4152.63,
      "location": 2,
      "content": "เอาจริงเหรอ"
    },
    {
      "from": 4154.47,
      "to": 4158.43,
      "location": 2,
      "content": "ดูสิ คุณไทจิกับคุณยามาโตะ\nอยู่ด้วยกันสองต่อสองแล้ว"
    },
    {
      "from": 4158.933,
      "to": 4160.933,
      "location": 2,
      "content": "หวังว่าจะคืนดีกันได้นะ"
    },
    {
      "from": 4161.13,
      "to": 4163.533,
      "location": 2,
      "content": "เอ๊ะ เขาทะเลาะกันเหรอครับ"
    },
    {
      "from": 4163.7,
      "to": 4167,
      "location": 2,
      "content": "เหมือนว่าเขายังรู้สึกเคืองกัน\nเรื่องเมื่อวันก่อนอยู่นะ"
    },
    {
      "from": 4167.266,
      "to": 4168.98,
      "location": 2,
      "content": "น่าจะทั้งคู่เลยละ"
    },
    {
      "from": 4169.733,
      "to": 4172.32,
      "location": 2,
      "content": "พวกเขายังเคืองกันอยู่แหละ ตึงกันสุด  ๆ"
    },
    {
      "from": 4173.15,
      "to": 4174.6,
      "location": 2,
      "content": "แน่นอนเลย"
    },
    {
      "from": 4179.66,
      "to": 4180.28,
      "location": 2,
      "content": "นี่"
    },
    {
      "from": 4182.49,
      "to": 4184.16,
      "location": 2,
      "content": "เรื่องเมื่อวันก่อน"
    },
    {
      "from": 4185.66,
      "to": 4190.67,
      "location": 2,
      "content": "ฉันเองก็ผิดที่ไปโมโหนายก่อน\nแต่นายควรตั้งสติให้มากกว่านี้หน่อย"
    },
    {
      "from": 4191.88,
      "to": 4195.67,
      "location": 2,
      "content": "หลังจากนี้ดิจิมอนติดเชื้อ\nอาจจะปรากฏตัวขึ้นอีกก็ได้"
    },
    {
      "from": 4197.67,
      "to": 4200.666,
      "location": 2,
      "content": "มัวแต่ลังเลอะไรอยู่ได้ ไม่สมกับเป็นนายเลย"
    },
    {
      "from": 4200.866,
      "to": 4202.97,
      "location": 2,
      "content": "ถ้าเป็นตัวนายเมื่อก่อน..."
    },
    {
      "from": 4203.18,
      "to": 4204.7,
      "location": 2,
      "content": "มันช่วยไม่ได้นี่"
    },
    {
      "from": 4206.02,
      "to": 4207.85,
      "location": 2,
      "content": "ฉันไม่เหมือนกับเมื่อก่อนแล้ว"
    },
    {
      "from": 4213.19,
      "to": 4217.53,
      "location": 2,
      "content": "พอได้เห็นสิ่งต่าง ๆ มากกว่าเมื่อก่อน\nฉันก็เริ่มจะไม่เข้าใจขึ้นมา"
    },
    {
      "from": 4219.36,
      "to": 4222.87,
      "location": 2,
      "content": "สิ่งที่เราทำมันถูกต้องหรือเปล่า"
    },
    {
      "from": 4223.7,
      "to": 4225.04,
      "location": 2,
      "content": "หรือว่า..."
    },
    {
      "from": 4226.2,
      "to": 4228.04,
      "location": 2,
      "content": "มันไม่ถูกต้องกันล่ะ"
    },
    {
      "from": 4237.88,
      "to": 4240.72,
      "location": 2,
      "content": "ฉันเข้าใจว่ามันเป็นเรื่องที่\nมีแต่พวกเราเท่านั้นที่ทำได้"
    },
    {
      "from": 4241.39,
      "to": 4244.05,
      "location": 2,
      "content": "แต่มันไม่ได้ง่ายขนาดนั้น"
    },
    {
      "from": 4247.8,
      "to": 4250.4,
      "location": 2,
      "content": "ทำแบบนั้นก็เท่ากับวิ่งหนีนั่นแหละ"
    },
    {
      "from": 4254.73,
      "to": 4257.73,
      "location": 2,
      "content": "ไทจิกับยามาโตะกำลังคุยอะไรกันเนี่ย"
    },
    {
      "from": 4258.07,
      "to": 4260.1,
      "location": 2,
      "content": "อยากรู้จังเลยเนอะ"
    },
    {
      "from": 4265.24,
      "to": 4267.37,
      "location": 2,
      "content": "สรุปแล้วเรามาทำอะไรที่นี่กันแน่"
    },
    {
      "from": 4267.58,
      "to": 4270.25,
      "location": 2,
      "content": "จริงสิ ลืมไปซะสนิทเลย"
    },
    {
      "from": 4272.58,
      "to": 4273.75,
      "location": 2,
      "content": "นั่นมัน..."
    },
    {
      "from": 4279.76,
      "to": 4281.59,
      "location": 2,
      "content": "ฉันเห็นการบิดเบือนจากตรงนั้น"
    },
    {
      "from": 4282.59,
      "to": 4285.26,
      "location": 2,
      "content": "ขอแจ้งให้ลูกค้าที่มาเยือนทุกท่านได้ทราบ"
    },
    {
      "from": 4285.47,
      "to": 4288.966,
      "location": 2,
      "content": "ขณะนี้ได้เกิดสภาพอากาศผิดปกติในท้องถิ่น\nเหนือน่านฟ้าของโอไดบะ"
    },
    {
      "from": 4289.1,
      "to": 4290.887,
      "location": 2,
      "content": "จึงมีการออกคำสั่งเตือนให้อพยพ"
    },
    {
      "from": 4290.911,
      "to": 4293.94,
      "location": 2,
      "content": "เนื่องจากเกรงว่า\nจะนำไปสู่ภัยพิบัติร้ายแรงค่ะ"
    },
    {
      "from": 4294.61,
      "to": 4299.28,
      "location": 2,
      "content": "รบกวนลูกค้าที่อยู่ในตัวอาคารช่วยปฏิบัติตาม\nพร้อมทั้งตรวจเช็กความปลอดภัยไปด้วยนะคะ"
    },
    {
      "from": 4299.78,
      "to": 4302.28,
      "location": 2,
      "content": "สำหรับกรณีฉุกเฉิน\nขอให้ทุกท่านรีบอพยพทันทีนะคะ"
    },
    {
      "from": 4311.96,
      "to": 4313.62,
      "location": 2,
      "content": "นี่มันอะไรกัน"
    },
    {
      "from": 4315.79,
      "to": 4317.433,
      "location": 2,
      "content": "พวกเด็ก ๆ เป็นยังไงบ้าง"
    },
    {
      "from": 4317.96,
      "to": 4319.96,
      "location": 2,
      "content": "ยังติดต่อไม่ได้เลยครับ"
    },
    {
      "from": 4329.14,
      "to": 4331.533,
      "location": 2,
      "content": "เมจัง เมจัง"
    },
    {
      "from": 4372.02,
      "to": 4373.64,
      "location": 2,
      "content": "นั่นมันอะไรกันน่ะ"
    },
    {
      "from": 4373.85,
      "to": 4375.69,
      "location": 2,
      "content": "ไม่เคยเห็นตัวแบบนี้มาก่อนเลย"
    },
    {
      "from": 4378.02,
      "to": 4380.19,
      "location": 2,
      "content": "เจอแล้วครับ มันคืออัลฟามอน"
    },
    {
      "from": 4380.69,
      "to": 4381.32,
      "location": 2,
      "content": "อัลฟามอน?"
    },
    {
      "from": 4381.53,
      "to": 4385.3,
      "location": 2,
      "content": "น่าเสียดายไม่ปรากฏอย่างอื่นบนข้อมูลเลยครับ"
    },
    {
      "from": 4385.36,
      "to": 4386.666,
      "location": 2,
      "content": "ต้องทำอะไรสักอย่างแล้ว"
    },
    {
      "from": 4386.966,
      "to": 4389.5,
      "location": 2,
      "content": "โคชิโร่คุง เรียกพวกพัลมอนออกมาหน่อยสิ"
    },
    {
      "from": 4389.53,
      "to": 4390.7,
      "location": 2,
      "content": "เข้าใจแล้วครับ"
    },
    {
      "from": 4391.37,
      "to": 4392.37,
      "location": 2,
      "content": "เจอแล้ว"
    },
    {
      "from": 4393.04,
      "to": 4394.37,
      "location": 2,
      "content": "เด็กคนนั้น"
    },
    {
      "from": 4394.866,
      "to": 4396.04,
      "location": 2,
      "content": "เมจัง"
    },
    {
      "from": 4397.54,
      "to": 4399.21,
      "location": 2,
      "content": "เมจัง!"
    },
    {
      "from": 4404.88,
      "to": 4406.05,
      "location": 2,
      "content": "เมย์โกะ!"
    },
    {
      "from": 4406.55,
      "to": 4407.88,
      "location": 2,
      "content": "เมจัง"
    },
    {
      "from": 4410.89,
      "to": 4412.51,
      "location": 2,
      "content": "เมย์โกะ ดีใจจัง"
    },
    {
      "from": 4412.72,
      "to": 4415.56,
      "location": 2,
      "content": "ไม่ต้องห่วง ไม่เป็นไรแล้วนะ"
    },
    {
      "from": 4443.25,
      "to": 4444.59,
      "location": 2,
      "content": "ทำไมกัน?"
    },
    {
      "from": 4450.26,
      "to": 4452.1,
      "location": 2,
      "content": "ทำอะไรอยู่ ไทจิ!"
    },
    {
      "from": 4460.1,
      "to": 4461.1,
      "location": 2,
      "content": "ทางนี้"
    },
    {
      "from": 4480.29,
      "to": 4481.46,
      "location": 2,
      "content": "เป็นอะไรหรือเปล่า"
    },
    {
      "from": 4482.46,
      "to": 4483.63,
      "location": 2,
      "content": "ยามาโตะ!"
    },
    {
      "from": 4486.13,
      "to": 4487.46,
      "location": 2,
      "content": "กาบูมอน?"
    },
    {
      "from": 4490.13,
      "to": 4491.666,
      "location": 2,
      "content": "เดี๋ยวพวกเราจะหาทางจัดการเอง"
    },
    {
      "from": 4491.933,
      "to": 4493.47,
      "location": 2,
      "content": "ลุยกันเลย กาบูมอน"
    },
    {
      "from": 4503.98,
      "to": 4505.3,
      "location": 2,
      "content": "- เบิร์ดรามอน!\n- คาบูเทริมอน!"
    },
    {
      "from": 4520.5,
      "to": 4521.633,
      "location": 2,
      "content": "ไทจิ!"
    },
    {
      "from": 4521.83,
      "to": 4523.266,
      "location": 2,
      "content": "โอเมกามอนไง"
    },
    {
      "from": 4530.17,
      "to": 4531.833,
      "location": 2,
      "content": "พัลมอน ถึงตาเธอแล้วนะ"
    },
    {
      "from": 4532,
      "to": 4532.68,
      "location": 2,
      "content": "โอเค"
    },
    {
      "from": 4545.65,
      "to": 4548.19,
      "location": 2,
      "content": "พัลมอน เปลี่ยนร่าง"
    },
    {
      "from": 4569.71,
      "to": 4570.88,
      "location": 2,
      "content": "โทเงมอน"
    },
    {
      "from": 4572.55,
      "to": 4573.72,
      "location": 2,
      "content": "พวกเราก็จะเอาด้วย"
    },
    {
      "from": 4574.6,
      "to": 4576.39,
      "location": 2,
      "content": "จิกุจิกุแบงแบง!"
    },
    {
      "from": 4596.41,
      "to": 4597.74,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 4598.41,
      "to": 4599.91,
      "location": 2,
      "content": "ฉันควรจะทำยังไงดี"
    },
    {
      "from": 4601.58,
      "to": 4602.91,
      "location": 2,
      "content": "เมจัง..."
    },
    {
      "from": 4603.91,
      "to": 4606.75,
      "location": 2,
      "content": "ฉันไม่ยกเมจังให้เด็ดขาด"
    },
    {
      "from": 4623.1,
      "to": 4624.77,
      "location": 2,
      "content": "ฉันต้องสู้แล้ว"
    },
    {
      "from": 4635.45,
      "to": 4636.78,
      "location": 2,
      "content": "ไทจิ!"
    },
    {
      "from": 4645.96,
      "to": 4647.79,
      "location": 2,
      "content": "ถ้านายไม่ทำอะไรเลยละก็..."
    },
    {
      "from": 4651.96,
      "to": 4653.96,
      "location": 2,
      "content": "ในเมื่อนายไม่ทำอะไรเลย"
    },
    {
      "from": 4654.3,
      "to": 4656.97,
      "location": 2,
      "content": "สุดท้ายแล้วนายก็ได้แต่วิ่งหนีเท่านั้นแหละ"
    },
    {
      "from": 4663.14,
      "to": 4666.14,
      "location": 2,
      "content": "ขืนเป็นแบบนี้ต่อไป\nยังไงทุกอย่างก็ต้องพังพินาศ"
    },
    {
      "from": 4667.14,
      "to": 4669.9,
      "location": 2,
      "content": "ไม่ใช่แค่เมือง แต่รวมถึงทุกคนด้วย"
    },
    {
      "from": 4672.433,
      "to": 4674.466,
      "location": 2,
      "content": "มีแต่พวกเราที่จัดการได้เท่านั้น"
    },
    {
      "from": 4723.53,
      "to": 4725.166,
      "location": 2,
      "content": "ไปกันเลย อากูมอน"
    },
    {
      "from": 4725.54,
      "to": 4727.2,
      "location": 2,
      "content": "วางใจได้เลย ไทจิ"
    },
    {
      "from": 4797.61,
      "to": 4798.833,
      "location": 2,
      "content": "โอเมกามอน!"
    },
    {
      "from": 4798.866,
      "to": 4799.93,
      "location": 2,
      "content": "รวมร่างแล้วสินะครับ"
    },
    {
      "from": 4938.08,
      "to": 4939.58,
      "location": 2,
      "content": "หนีไปได้งั้นเหรอ"
    },
    {
      "from": 4940.79,
      "to": 4941.71,
      "location": 2,
      "content": "ไทจิ"
    },
    {
      "from": 4941.92,
      "to": 4943.09,
      "location": 2,
      "content": "คุณยามาโตะ"
    },
    {
      "from": 4954.93,
      "to": 4957.06,
      "location": 2,
      "content": "สิ่งที่คุณโมจิซึกิกำลังตามหาอยู่..."
    },
    {
      "from": 4957.27,
      "to": 4959.466,
      "location": 2,
      "content": "ใช่ค่ะ เด็กคนนี้แหละ"
    },
    {
      "from": 4959.77,
      "to": 4961.7,
      "location": 2,
      "content": "ชื่อว่าเมจังเหรอคะ"
    },
    {
      "from": 4961.77,
      "to": 4964.4,
      "location": 2,
      "content": "ชื่อจริงคือเมคูมอนค่ะ"
    },
    {
      "from": 4964.61,
      "to": 4966.11,
      "location": 2,
      "content": "เมคูมอน?"
    },
    {
      "from": 4971.28,
      "to": 4973.766,
      "location": 2,
      "content": "เขาเป็นดิจิมอนคู่หูของฉันค่ะ"
    },
    {
      "from": 4977.79,
      "to": 4980.29,
      "location": 2,
      "content": "แสดงว่าเธอก็เป็นเด็กผู้ถูกเลือกเหรอ"
    },
    {
      "from": 4980.79,
      "to": 4982.96,
      "location": 2,
      "content": "ใช่ค่ะ คิดว่าแบบนั้น"
    },
    {
      "from": 4983.79,
      "to": 4984.733,
      "location": 2,
      "content": "ดีใจจัง"
    },
    {
      "from": 4985.033,
      "to": 4987.266,
      "location": 2,
      "content": "ขอโทษที่ไม่ได้บอกนะคะ"
    },
    {
      "from": 4987.3,
      "to": 4988.97,
      "location": 2,
      "content": "มีพวกพ้องเพิ่มขึ้นมาแล้วนะ"
    },
    {
      "from": 4990.13,
      "to": 4991.233,
      "location": 2,
      "content": "ดีใจจังเลย"
    },
    {
      "from": 4991.3,
      "to": 4994.93,
      "location": 2,
      "content": "เมจัง ทุกคนช่วยเราเอาไว้"
    },
    {
      "from": 4995.14,
      "to": 4996.64,
      "location": 2,
      "content": "ค่อยยังชั่วที่ปลอดภัยนะ"
    },
    {
      "from": 4998.766,
      "to": 4999.63,
      "location": 2,
      "content": "ขอบจั๋ยนะ"
    },
    {
      "from": 4999.64,
      "to": 5000.666,
      "location": 2,
      "content": "ขอบจั๋ยนะ"
    },
    {
      "from": 5001.81,
      "to": 5002.9,
      "location": 2,
      "content": "อะไรเหรอ"
    },
    {
      "from": 5004.98,
      "to": 5007.98,
      "location": 2,
      "content": "แปลว่า \"ขอบคุณ\" น่ะค่ะ"
    },
    {
      "from": 5269,
      "to": 5270.26,
      "location": 2,
      "content": "ปล่อยวางได้แล้วเหรอ"
    },
    {
      "from": 5275.233,
      "to": 5278.6,
      "location": 2,
      "content": "ฉันจะยอมรับแค่เรื่องที่\nนายไม่ได้วิ่งหนีแล้วกัน"
    }
  ];

  dataInfo: any = {};
  date: any;
  reportFocus: any;
  public dataBranch: any;
  user$: Observable<UserType>;
  constructor(
    private auth: AuthService, public dashboardService: DashboardService) {
    //dateAdapter.setLocale('th-th');
    //console.log(moment.monthsShort())
    
  }

  ngOnInit(): void {

    let str = '';
    //     1
    //    00:00:48,58 --> 00:00:50,14
    //    ตั้งแต่สมัยบรรพกาล
    
    // console.log('this.data.length',this.data.length)
    // each(this.data, (item, index) => {
    //   str += (index + 1) + '\n';
    //   let miis = item.from + 11.9;
    //   let miisTo = item.to + 11.9;
    //   str += `${new Date(miis * 1000).toISOString().slice(11, 23).replace('.', ',')} --> ${new Date(miisTo * 1000).toISOString().slice(11, 23).replace('.', ',')}\n`
    //   str += `${item.content}\n\n`;
    // })
    // console.log('str',str)

    // this.user$ = this.auth.currentUserSubject.asObservable();
    // this.user$.subscribe((user) => {
    //   this.dashboardService.selectBranch(user?.branchId);
    // })
  }


}
